{"courses": [{"depart": null, "id": null, "name": null, "desc": "(Credit to be arranged.) Consent of instructor.", "cred": "0", "p": null, "pre": ""}, {"depart": null, "id": null, "name": null, "desc": "", "cred": "3", "p": null, "pre": ""}, {"depart": null, "id": null, "name": null, "desc": "This course explores a variety of shared memory concurrent programming techniques with special emphasis on their correctness performance and scalability characteristics on modern CPU architectures.", "cred": "3", "p": null, "pre": "CS 333"}, {"depart": null, "id": null, "name": null, "desc": "Please see the instructor/professor teaching this course the quarter it is offered for a course description.", "cred": "3", "p": null, "pre": ""}, {"depart": null, "id": null, "name": null, "desc": "Computational photography is a field where computer graphics vision optics and photography come together to create high-quality pictures. This course will discuss computational techniques to overcome the limitations of traditional cameras and enhance their capabilities. This course will cover topics ranging from concepts of digital camera and photography to computer vision and graphics techniques for creating high-quality pictures including high dynamic range imaging panorama stitching image segmentation & matting video stabilization etc. Course website", "cred": "3", "p": null, "pre": "CS 202 or its equivalence"}, {"depart": null, "id": null, "name": null, "desc": "This is a place holder for this topic. Please check with the instructor/professor the quarter this course is offered for specific content.", "cred": "3", "p": null, "pre": ""}, {"depart": null, "id": null, "name": null, "desc": "Successively reduce common arithmetic operations to simpler  mathematical steps; measured Cloud computing has recently seen a lot of attention from research and  industry for applications that can be parallelized on shared-nothing  architectures and have a need for elastic scalability. As a consequence  new data management requirements have emerged with multiple solutions  to address them. This course will look at the principles behind data  management in the cloud as well as discuss actual cloud data management  systems that are currently in use or being developed. The topics covered  in the course range from novel data processing paradigms (MapReduce  Scope DryadLINQ) to commercial cloud data management platforms (Google  BigTable Microsoft Azure Amazon S3 and Dynamo Yahoo PNUTS) and  open-source NoSQL databases (Cassandra MongoDB Neo4J). The world of  cloud data management is currently very diverse and heterogeneous.  Therefore our course will also report on efforts to classify compare  and benchmark the various approaches and systems. Students in this  course will gain broad knowledge about the current state of the art in  cloud data management and through a course project practical  experience with a specific system.", "cred": "3", "p": null, "pre": "Students must have a knowledge of database design implementation and query languages (CS 386 CS 586 or equivalent) and must be comfortable programming in a language appropriate for systems implementation such as C/C++ Java or C#."}, {"depart": null, "id": null, "name": null, "desc": "This course will introduce you to the fundamental principles of human-computer interaction (HCI). This course will cover a brief history of HCI and will expose you to a variety of user research and design techniques through hands-on engagement with a creative interaction design process. The course will also introduce you to some open questions and challenges in current HCI research. No prior programming experience is necessary to succeed in this course.", "cred": "3", "p": null, "pre": ""}, {"depart": null, "id": null, "name": null, "desc": "This is a new course designed to survey the fundamentals of  measuring  analyzing and modeling computer performance.  As we learn  the material  we will move through a set of case studies allowing us to  apply the  techniques to increasingly complex problems.  Case studies  in Fall 2014  will include", "cred": 3, "p": null, "pre": "CS 201 CS 333 and CS 350 or equivalent.  These are"}, {"depart": null, "id": null, "name": null, "desc": "This   course will provide an introduction to visual computing. It will cover   algorithms in computer vision and image/video processing. It will focus on   the development of visual computing applications using off-the-shelf visual   computing libraries such as OpenCV.", "cred": 3, "p": null, "pre": "CS 202"}, {"depart": null, "id": null, "name": null, "desc": "This course is about the development of low-level bare-metal systems—with particular focus on microkernels—and about the role and design of programming languages in this application domain—from low-level assembly to high-level functional and domain specific languages.  The course material is organized in to three parts", "cred": "3", "p": null, "pre": "There are no formal prerequisites for this class but students are expected to have some background in operating systems (as a result of taking a class like CS333 at the undergraduate level or CS533 at the graduate level) and programming languages (as a result of taking classes like CS321/322 at the undergraduate level or CS558 at the graduate level).  As a practical consideration this class will involve substantial programming exercises using C and assembly language in a IA32 Linux environment.  Prior experience with the Linux command line and standard toolset will be expected together with significant programming experience."}, {"depart": null, "id": null, "name": null, "desc": "This course will explore the interplay of the Internet crowds and markets with the examples of Amazon Netflix Groupon eBay Yelp Trip Advisor Mechanical Turk Google Facebook and BitCoin. In particular we will study how the Internet enables companies to exploit and profit from the \"long tail\" of human interests. Specific topics covered include auctions and sponsored search markets reputation systems and collaborative filtering personalization privacy and tracking on the Internet incentives and crowd sourcing virtual currencies (e.g.. Bitcoin) social marketing networked pricing and prediction markets.", "cred": null, "p": null, "pre": null}, {"depart": null, "id": null, "name": null, "desc": "The past few years have witnessed the dramatic emergence of mobile phone applications (Android health app) and wearable devices (e.g..           Fitbit Jawbone Nike Fuelband Google Glasses etc.) as a           platform for personalized health care. or what is referred to as           mHealth. By leveraging state of the art computing technologies           for advanced diagnostics mHealth has the unprecedented           potential to radically revolutionize medicine in the coming           decade making it personalized participatory predictive and           preventative. Here is why. Today medicine is           designed for the average patient rather than tailored to a           specific person. Consequently treatments succeed for some           patients but do not for others. mHealth can provide           clinicians the technological tools to better understand           individual differences in people's genes environment           lifestyles etc. and predict the efficacy of treatments.\nThe course will be comprised of           reading and reviewing the latest research papers and case           studies. The course will also feature several guest lectures           from experts in the field. The           course will explore a range of issues related to implementing           and realizing mHealth technologies such as", "cred": "3", "p": null, "pre": ""}, {"depart": null, "id": null, "name": null, "desc": "Prepare students to design construct and evaluate spoken language applications. Analyze when speech applications are appropriate and when they are not. Write speech grammars prompts and event handlers. Design system-directed and mixed initiative dialogs. Apply languages for implementing speech applications. Test speech applications for performance and usability.", "cred": "3", "p": null, "pre": ""}, {"depart": null, "id": null, "name": null, "desc": null, "cred": null, "p": null, "pre": null}, {"depart": null, "id": null, "name": null, "desc": "The fundamental concepts of object-oriented programming languages including data abstraction and typing class inheritance and generic types prototypes and delegation concurrency control and distribution object-oriented databases and implementation. To illustrate these issues programming assignments in languages such as Smalltalk Eiffel and C++ will be given.", "cred": "3", "p": null, "pre": "CS 320"}, {"depart": null, "id": null, "name": null, "desc": "Survey of concepts and techniques used in modern operating systems. Sample concepts covered are concurrency IPC's scheduling resource allocation memory management file systems and security. Techniques for implementing operating systems taught through a programming project.", "cred": "3", "p": null, "pre": "CS 333"}, {"depart": null, "id": null, "name": null, "desc": "Processors memory hierarchy and bus systems. Multi-level caches and cache coherence in MP systems. Arithmetic algorithms. RISC vs. CISC instructions pipelining and software pipelining. Superscalar superpipelined and VLIW architectures. Connection networks. Performance evaluation simulation and analytic models. Performance enhancement through branch prediction and out-of-order execution.", "cred": "3", "p": null, "pre": "CS 320 or 333."}, {"depart": null, "id": null, "name": null, "desc": "Introduction to the basic concepts and techniques of artificial intelligence. Knowledge representation problem solving machine learning natural language understanding and AI search techniques.", "cred": "3", "p": null, "pre": "CS 202"}, {"depart": null, "id": null, "name": null, "desc": "Covers the theory and practice of finding optimal and satisfying solutions to one-player and two-player combinatorial games including such popular games as Sokoban Othello checkers chess backgammon bridge and CCGs. Simple applications in decision theory and economics may also be discussed. Emphasis on implementation of state-of-the-art solution techniques. Prerequisite", "cred": "3", "p": null, "pre": ""}, {"depart": null, "id": null, "name": null, "desc": "Provides a broad introduction to techniques for building computer systems that learn from experience; conceptual grounding and practical experience with several learning systems; and grounding for advanced study in statistical learning methods and for work with adaptive technologies used in speech and image processing robotic planning and control diagnostic systems complex system modeling and iterative optimization. Students gain practical experience implementing and evaluating systems applied to pattern recognition prediction and optimization problems.", "cred": "3", "p": null, "pre": "Mth 261 or Mth 343; and CS 202 or permission of the instructor"}, {"depart": null, "id": null, "name": null, "desc": "Covers a number of more advanced topics in machine learning from a more mathematically oriented view. Provides preparation for successfully using machine-learning techniques for various applications. Also provides preparation for graduate- level research in machine learning and adaptive systems.", "cred": "3", "p": null, "pre": "CS 445/545 or equivalent or permission of the instructor."}, {"depart": null, "id": null, "name": null, "desc": "This course will provide an introduction to graphics systems and applications. Basic structure of interactive graphics systems characteristics of various hardware devices. Control of display devices implementation of simple packages device independence and standard packages. Distributed architectures for graphics hidden line and hidden surfaces algorithms representations of curves and surfaces.", "cred": "3", "p": null, "pre": "CS 202 MTH 261"}, {"depart": null, "id": null, "name": null, "desc": "Introduction to numerical methods. Includes topics from elementary discussion of errors polynomials interpolation quadrature linear systems of equations and solution of nonlinear equations.", "cred": "3", "p": null, "pre": "MTH 261"}, {"depart": null, "id": null, "name": null, "desc": "Software Design Patterns are reusable solutions to recurring software problems. They capture successful experiences and convey expert insight and knowledge to less experienced developers. This course provides an in-depth view of patterns using Java as the presentation language. The course is suitable to software architects and developers who are already well-versed in this language. In addition this course will offer continuous opportunities for learning the most advanced features of the Java language and understanding some principles behind the design of its fundamental libraries.", "cred": "3", "p": null, "pre": "programming in Java and CS 520"}, {"depart": null, "id": null, "name": null, "desc": "Current methodologies for the development of large industrial strength software systems. Topics include requirements specification design implementation testing project management and cost estimation formal methods and software process improvement.", "cred": "3", "p": null, "pre": "CS 320"}, {"depart": null, "id": null, "name": null, "desc": "Theoretical and practical aspects of the software development process or software lifecycle. Covers the second part of the cycle", "cred": "3", "p": null, "pre": ""}, {"depart": null, "id": null, "name": null, "desc": "Introduction to functional notation recursion higher-order functions reasoning about functions and models for the evaluation of applicative expressions. Use of functional languages.", "cred": "3", "p": null, "pre": "CS 202 311 Expected background of a senior or graduate student in CS."}, {"depart": null, "id": null, "name": null, "desc": "In-depth study of current and historical issues in the design implementation and application of programming languages. Topics range from basic to advanced. Areas include syntax semantics scoping typing abstraction exceptions and concurrency. Computational paradigms such as functional logic and/or object-oriented are analyzed. Several \"recent\" programming languages are used.", "cred": "3", "p": null, "pre": "CS 320 or equivalent"}, {"depart": null, "id": null, "name": null, "desc": "Introduction to the basic theory of human-computer interaction. Principles of human cognition and interface design interface evaluation techniques. Several prototyping tools will be presented. A project is required.", "cred": "3", "p": null, "pre": "Stat 451 CS 202 Knowledge of HTML"}, {"depart": null, "id": null, "name": null, "desc": "This course is a one-credit graduate seminar for students who have already taken a course in Machine Learning. Students will read and discuss recent papers in the Machine Learning literature. Each student will be responsible for presenting at least one paper during the term. This one-credit course will be offered each term and students may take it multiple times.", "cred": "1", "p": null, "pre": "CS 445/545 or permission of the instructor."}, {"depart": null, "id": null, "name": null, "desc": "Introduction to the principles of computer security. Development of the notion of security through formal models and the examination of existing secure systems. Systems intended for the protection of classified information as well as commercial systems will be examined.", "cred": "3", "p": null, "pre": "CS 333/533"}, {"depart": null, "id": null, "name": null, "desc": "Probabilistic tools used in the design and analysis of modern algorithms and data structures. Topics include", "cred": "3", "p": null, "pre": "CS 350 STAT 451"}, {"depart": null, "id": null, "name": null, "desc": "Computability theory", "cred": "3", "p": null, "pre": ""}, {"depart": null, "id": null, "name": null, "desc": "An advanced in-depth study of the design and analysis of algorithms. Topics include models of computation sorting data structures graph algorithms matrix multiplication fast Fourier transform polynomial arithmetic pattern matching and NP-complete problems.", "cred": "3", "p": null, "pre": "CS 350 or equivalent"}, {"depart": null, "id": null, "name": null, "desc": "The goal of cryptography is the encoding of information via a cryptographic system. Cryptanalysis studies the breaking of cryptosystems. This course focuses on cryptography but with respect to cryptanalysis. An overview of classical systems with an in-depth examination of modern cryptosystems. This includes block algorithms such as DES; public-key cryptosystems such as RSA; and one-way functions. Additional topics include cryptographic protocols signature schemes pseudo-random number generation Shannon’s information theory and stream ciphers.", "cred": "3", "p": null, "pre": "CS 350"}, {"depart": null, "id": null, "name": null, "desc": "Introduction to fundamental concepts of database management using primarily the relational model. Schema design and refinement. Query languages. Database application environments. Physical data organization. Overview of query optimization and processing physical design recovery and concurrency control. Query processing for search engines. The course will cover topics such as security data warehousing and analytic databases. Students will present a report on an advanced topic.", "cred": "3", "p": null, "pre": "CS 161 250. Recommended Prerequisite CS 251"}, {"depart": null, "id": null, "name": null, "desc": "Internal design of a relational database management system. Concurrency control; lock managers; crash recovery; query and operator evaluation; query optimization; storage management; index structures; system catalogs.", "cred": "3", "p": null, "pre": "CS 486/586 and CS 333"}, {"depart": null, "id": null, "name": null, "desc": "This course explores the foundations of database systems with a focus on data models and query languages. It will show how formal methods are applied to issues in database design and processing. Topics may include query formalisms and their equivalence query transformation semi-structured data models dependencies and normal forms logic and deductive databases data language complexity treatment of incomplete information complex-value models semantic models and classification and temporal databases.", "cred": "3", "p": null, "pre": "CS 386 or CS 586 or equivalent course; familiarity with discrete math and logic that could be satisfied by CS 250/CS 251 or by Mth 356."}, {"depart": null, "id": null, "name": null, "desc": "Provides a broad overview of computer security. Provides a solid theoretical foundation as well as real-world examples for understanding computer security. Fundamental theoretical results foundational models and salient examples will be covered. Security in computer operating systems networks and data will be covered with emphasis on operating system and program security.", "cred": "3", "p": null, "pre": "CS 333 350 C and Java programming."}, {"depart": null, "id": null, "name": null, "desc": "This course will study the motivations of malicious   code developers and the common weaknesses exploited by such code. The   course will then examine the identification and remedy of malicious   code.", "cred": "3", "p": null, "pre": ""}, {"depart": null, "id": null, "name": null, "desc": "Detailed hands-on approach to the investigation of criminal incidents in which computers or computer technology play a significant or interesting role. Familiarization with the core computer science theory and practical skills necessary to perform rudimentary computer forensic investigations understanding the role of technology in investigating computer-based crime and preparation to deal with investigative bodies.", "cred": "3", "p": null, "pre": "Recommended"}, {"depart": null, "id": null, "name": null, "desc": "Advanced study of the protocols and algorithms used in the Internet (IETF) family of networking protocols. For example ARP IP UDP TCP multicasting routing protocols like RIP and OSPF and application protocols like DNS NFS SNMP FTP and HTTP. Issues such as addressing name service protocol design and scaleability will be explored.", "cred": "3", "p": null, "pre": "CS 333 or equivalent."}, {"depart": null, "id": null, "name": null, "desc": "Foundations of sensor networks with a focus on activity-based learning through a sequence of hands-on programming exercises with embedded devices with a high-level programming language. Basic building blocks in designing and deploying a sensor network application. Positioning and time synchronization of networked sensor devices wireless communication characteristics of low-powered radios energy conservation and harvesting macro-programming a network of sensor devices and security.", "cred": "3", "p": null, "pre": "Recommended prerequisites"}, {"depart": null, "id": null, "name": null, "desc": "Introduction to wireless networking concepts at the physical Mac (Medium Access Control) and higher layers; develop an understanding of 802.11 family of protocols; examine cellular standards like 3G and 4G LET; examples of evolving applications of wifi;", "cred": "3", "p": null, "pre": "CS 333 or equivalents"}, {"depart": null, "id": null, "name": null, "desc": "Computational photography is a field where computer  graphics vision optics and photography come together to create  high-quality pictures. This course will discuss computational techniques  to overcome the limitations of traditional cameras and enhance their  capabilities. This course will cover topics ranging from concepts of  digital camera and photography to computer vision and graphics  techniques for creating high-quality pictures including high dynamic  range imaging panorama stitching image segmentation & matting  video stabilization etc. Course website", "cred": "3", "p": null, "pre": "CS 202 or its equivalence"}, {"depart": null, "id": null, "name": null, "desc": "The purpose of this course is to make participants better scholars in Computer Science. In particular it attempts to help students become better researchers better writers better presenters and better reviewers. It concentrates on reading writing and composition skills", "cred": "3", "p": null, "pre": "Admission into a Ph.D. program within MCECS. All students must be proficient in written and spoken English before taking this course."}]}