{"courses": [{"depart": "CS", "id": "504", "name": "Cooperative Education/Internship", "desc": "(Credit to be arranged.) Consent of instructor.", "cred": "0", "p": null, "pre": []}, {"depart": "CS", "id": "507", "name": "Category Theory Seminar", "desc": "", "cred": "3", "p": null, "pre": []}, {"depart": "CS", "id": "510", "name": "Top: Advanced Topics in Concurrency", "desc": "This course explores a variety of shared memory concurrent programming techniques with special emphasis on their correctness, performance and scalability characteristics on modern CPU architectures.", "cred": "3", "p": null, "pre": ["CS 333"]}, {"depart": "CS", "id": "510", "name": "Top: Algorithms For Parallel Computation", "desc": "Please see the instructor/professor teaching this course the quarter it is offered for a course description.", "cred": "3", "p": null, "pre": []}, {"depart": "CS", "id": "510", "name": "Top: Computational Photography", "desc": "Computational photography is a field where computer graphics, vision, optics, and photography come together to create high-quality pictures. This course will discuss computational techniques to overcome the limitations of traditional cameras and enhance their capabilities. This course will cover topics ranging from concepts of digital camera and photography to computer vision and graphics techniques for creating high-quality pictures, including high dynamic range imaging, panorama stitching, image segmentation & matting, video stabilization, etc. Course website", "cred": "3", "p": null, "pre": ["CS 202"]}, {"depart": "CS", "id": "510", "name": "Top: Concurrent Systems", "desc": "This is a place holder for this topic. Please check with the instructor/professor the quarter this course is offered for specific content.", "cred": "3", "p": null, "pre": []}, {"depart": "CS", "id": "510", "name": "Top: Data Management in the Cloud", "desc": "Successively reduce common arithmetic operations to simpler  mathematical steps; measured Cloud computing has recently seen a lot of attention from research and  industry for applications that can be parallelized on shared-nothing  architectures and have a need for elastic scalability. As a consequence,  new data management requirements have emerged with multiple solutions  to address them. This course will look at the principles behind data  management in the cloud as well as discuss actual cloud data management  systems that are currently in use or being developed. The topics covered  in the course range from novel data processing paradigms (MapReduce,  Scope, DryadLINQ), to commercial cloud data management platforms (Google  BigTable, Microsoft Azure, Amazon S3 and Dynamo, Yahoo PNUTS) and  open-source NoSQL databases (Cassandra, MongoDB, Neo4J). The world of  cloud data management is currently very diverse and heterogeneous.  Therefore, our course will also report on efforts to classify, compare  and benchmark the various approaches and systems. Students in this  course will gain broad knowledge about the current state of the art in  cloud data management and, through a course project, practical  experience with a specific system.", "cred": "3", "p": null, "pre": ["CS 386", "CS 586"]}, {"depart": "CS", "id": "510", "name": "Top: Introduction to HCI", "desc": "This course will introduce you to the fundamental principles of human-computer interaction (HCI). This course will cover a brief history of HCI, and will expose you to a variety of user research and design techniques through hands-on engagement with a creative interaction design process. The course will also introduce you to some open questions and challenges in current HCI research. No prior programming experience is necessary to succeed in this course.", "cred": "3", "p": null, "pre": []}, {"depart": "CS", "id": "510", "name": "Top: Introduction to Performance Measurement, Modeling and Analysis", "desc": "This is a new course designed to survey the fundamentals of  measuring,  analyzing, and modeling computer performance.  As we learn  the material  we will move through a set of case studies, allowing us to  apply the  techniques to increasingly complex problems.  Case studies  in Fall 2014  will include", "cred": 3, "p": null, "pre": ["CS 201", "CS 333", "CS 350"]}, {"depart": "CS", "id": "510", "name": "Introduction to Visual Computing", "desc": "This   course will provide an introduction to visual computing. It will cover   algorithms in computer vision and image/video processing. It will focus on   the development of visual computing applications using off-the-shelf visual   computing libraries, such as OpenCV.", "cred": 3, "p": null, "pre": ["CS 202"]}, {"depart": "CS", "id": "510", "name": "Languages and Low-Level Programming", "desc": "This course is about the development of low-level, bare-metal systems—with particular focus on microkernels—and about the role and design of programming languages in this application domain—from low-level assembly, to high-level functional and domain specific languages.  The course material is organized in to three parts", "cred": "3", "p": null, "pre": ["CS333", "CS533", "CS321", "CS558"]}, {"depart": "CS", "id": "510", "name": "Markets and the Internet ", "desc": "This course will explore the interplay of the Internet, crowds and markets with the examples of Amazon, Netflix, Groupon, eBay, Yelp, Trip Advisor, Mechanical Turk, Google, Facebook and BitCoin. In particular, we will study how the Internet enables companies to exploit and profit from the \"long tail\" of human interests. Specific topics covered include auctions and sponsored search markets, reputation systems and collaborative filtering, personalization, privacy and tracking on the Internet, incentives and crowd sourcing, virtual currencies (e.g.. Bitcoin), social marketing, networked pricing, and prediction markets.", "cred": null, "p": null, "pre": []}, {"depart": "CS", "id": "510", "name": "Mobile Health", "desc": "The past few years have witnessed the dramatic emergence of mobile phone applications (Android health app) and wearable devices (e.g..           Fitbit, Jawbone, Nike Fuelband, Google Glasses, etc.) as a           platform for personalized health care., or what is referred to as           mHealth. By leveraging state of the art computing technologies           for advanced diagnostics, mHealth has the unprecedented           potential to radically revolutionize medicine in the coming           decade, making it personalized, participatory, predictive and           preventative. Here is why. Today medicine is           designed for the average patient, rather than tailored to a           specific person. Consequently, treatments succeed for some           patients, but do not for others. mHealth can provide           clinicians the technological tools to better understand           individual differences in people's genes, environment,           lifestyles, etc. and predict the efficacy of treatments.\nThe course will be comprised of           reading and reviewing the latest research papers and case           studies. The course will also feature several guest lectures           from experts in the field. The           course will explore a range of issues related to implementing           and realizing mHealth technologies, such as", "cred": "3", "p": null, "pre": []}, {"depart": "CS", "id": "510", "name": "Top: Spoken Language Interfaces", "desc": "Prepare students to design, construct, and evaluate spoken language applications. Analyze when speech applications are appropriate and when they are not. Write speech grammars, prompts, and event handlers. Design system-directed and mixed initiative dialogs. Apply languages for implementing speech applications. Test speech applications for performance and usability.", "cred": "3", "p": null, "pre": []}, {"depart": "CS", "id": "515", "name": "Parallel Programming", "desc": null, "cred": null, "p": null, "pre": []}, {"depart": "CS", "id": "520", "name": "Object Oriented Programming", "desc": "The fundamental concepts of object-oriented programming languages, including data abstraction and typing, class inheritance and generic types, prototypes and delegation, concurrency control and distribution, object-oriented databases, and implementation. To illustrate these issues, programming assignments in languages such as Smalltalk, Eiffel and C++ will be given.", "cred": "3", "p": null, "pre": ["CS 320"]}, {"depart": "CS", "id": "533", "name": "Concepts of Operating Systems", "desc": "Survey of concepts and techniques used in modern operating systems. Sample concepts covered are concurrency, IPC's scheduling, resource allocation, memory management, file systems, and security. Techniques for implementing operating systems taught through a programming project.", "cred": "3", "p": null, "pre": ["CS 333"]}, {"depart": "CS", "id": "538", "name": "Computer Architecture", "desc": "Processors, memory hierarchy, and bus systems. Multi-level caches and cache coherence in MP systems. Arithmetic algorithms. RISC vs. CISC instructions, pipelining, and software pipelining. Superscalar, superpipelined, and VLIW architectures. Connection networks. Performance evaluation, simulation, and analytic models. Performance enhancement through branch prediction and out-of-order execution.", "cred": "3", "p": null, "pre": ["CS 320"]}, {"depart": "CS", "id": "541", "name": "Artificial Intelligence", "desc": "Introduction to the basic concepts and techniques of artificial intelligence. Knowledge representation, problem solving, machine learning, natural language understanding, and AI search techniques.", "cred": "3", "p": null, "pre": ["CS 202"]}, {"depart": "CS", "id": "542", "name": "Advanced Artificial Intelligence: Combinatorial Games", "desc": "Covers the theory and practice of finding optimal and satisfying solutions to one-player and two-player combinatorial games, including such popular games as Sokoban, Othello, checkers, chess, backgammon, bridge, and CCGs. Simple applications in decision theory and economics may also be discussed. Emphasis on implementation of state-of-the-art solution techniques. Prerequisite", "cred": "3", "p": null, "pre": []}, {"depart": "CS", "id": "545", "name": "Machine Learning", "desc": "Provides a broad introduction to techniques for building computer systems that learn from experience; conceptual grounding and practical experience with several learning systems; and grounding for advanced study in statistical learning methods, and for work with adaptive technologies used in speech and image processing, robotic planning and control, diagnostic systems, complex system modeling, and iterative optimization. Students gain practical experience implementing and evaluating systems applied to pattern recognition, prediction, and optimization problems.", "cred": "3", "p": null, "pre": ["Mth 261", "Mth 343", "CS 202"]}, {"depart": "CS", "id": "546", "name": "Advanced Topics in Machine Learning", "desc": "Covers a number of more advanced topics in machine learning from a more mathematically oriented view. Provides preparation for successfully using machine-learning techniques for various applications. Also provides preparation for graduate- level research in machine learning and adaptive systems.", "cred": "3", "p": null, "pre": ["CS 445"]}, {"depart": "CS", "id": "547", "name": "Computer Graphics", "desc": "This course will provide an introduction to graphics systems and applications. Basic structure of interactive graphics systems, characteristics of various hardware devices. Control of display devices, implementation of simple packages, device independence, and standard packages. Distributed architectures for graphics, hidden line and hidden surfaces algorithms, representations of curves and surfaces.", "cred": "3", "p": null, "pre": ["CS 202", "MTH 261"]}, {"depart": "CS", "id": "551", "name": "Numerical Computation", "desc": "Introduction to numerical methods. Includes topics from elementary discussion of errors, polynomials, interpolation, quadrature, linear systems of equations, and solution of nonlinear equations.", "cred": "3", "p": null, "pre": ["MTH 261"]}, {"depart": "CS", "id": "553", "name": "Design Patterns", "desc": "Software Design Patterns are reusable solutions to recurring software problems. They capture successful experiences and convey expert insight and knowledge to less experienced developers. This course provides an in-depth view of patterns using Java as the presentation language. The course is suitable to software architects and developers who are already well-versed in this language. In addition, this course will offer continuous opportunities for learning the most advanced features of the Java language and understanding some principles behind the design of its fundamental libraries.", "cred": "3", "p": null, "pre": ["CS 520"]}, {"depart": "CS", "id": "554", "name": "Software Engineering", "desc": "Current methodologies for the development of large, industrial strength software systems. Topics include requirements, specification, design, implementation, testing, project management and cost estimation, formal methods, and software process improvement.", "cred": "3", "p": null, "pre": ["CS 320"]}, {"depart": "CS", "id": "556", "name": "Software Implementation and Testing", "desc": "Theoretical and practical aspects of the software development process or software lifecycle. Covers the second part of the cycle", "cred": "3", "p": null, "pre": []}, {"depart": "CS", "id": "557", "name": "Functional Languages", "desc": "Introduction to functional notation, recursion, higher-order functions, reasoning about functions, and models for the evaluation of applicative expressions. Use of functional languages.", "cred": "3", "p": null, "pre": ["CS 202"]}, {"depart": "CS", "id": "558", "name": "Programming Languages", "desc": "In-depth study of current and historical issues in the design, implementation, and application of programming languages. Topics range from basic to advanced. Areas include syntax, semantics, scoping, typing, abstraction, exceptions, and concurrency. Computational paradigms such as functional, logic, and/or object-oriented are analyzed. Several \"recent\" programming languages are used.", "cred": "3", "p": null, "pre": ["CS 320"]}, {"depart": "CS", "id": "560", "name": "Human-Computer Interaction", "desc": "Introduction to the basic theory of human-computer interaction. Principles of human cognition and interface design, interface evaluation techniques. Several prototyping tools will be presented. A project is required.", "cred": "3", "p": null, "pre": ["Stat 451", "CS 202"]}, {"depart": "CS", "id": "570", "name": "Machine Learning Seminar ", "desc": "This course is a one-credit graduate seminar for students who have already taken a course in Machine Learning. Students will read and discuss recent papers in the Machine Learning literature. Each student will be responsible for presenting at least one paper during the term. This one-credit course will be offered each term, and students may take it multiple times.", "cred": "1", "p": null, "pre": ["CS 445"]}, {"depart": "CS", "id": "576", "name": "Computer Security", "desc": "Introduction to the principles of computer security. Development of the notion of security through formal models and the examination of existing secure systems. Systems intended for the protection of classified information as well as commercial systems will be examined.", "cred": "3", "p": null, "pre": ["CS 333"]}, {"depart": "CS", "id": "580", "name": "Randomized Algorithms and Probabilistic Analysis", "desc": "Probabilistic tools used in the design and analysis of modern algorithms and data structures. Topics include", "cred": "3", "p": null, "pre": ["CS 350", "STAT 451"]}, {"depart": "CS", "id": "581", "name": "Theory of Computation", "desc": "Computability theory", "cred": "3", "p": null, "pre": []}, {"depart": "CS", "id": "684", "name": "Algorithm Design & Analysis", "desc": "An advanced in-depth study of the design and analysis of algorithms. Topics include models of computation, sorting, data structures, graph algorithms, matrix multiplication, fast Fourier transform, polynomial arithmetic, pattern matching, and NP-complete problems.", "cred": "3", "p": null, "pre": ["CS 350"]}, {"depart": "CS", "id": "585", "name": "Cryptography", "desc": "The goal of cryptography is the encoding of information via a cryptographic system. Cryptanalysis studies the breaking of cryptosystems. This course focuses on cryptography but with respect to cryptanalysis. An overview of classical systems with an in-depth examination of modern cryptosystems. This includes block algorithms such as DES; public-key cryptosystems, such as RSA; and one-way functions. Additional topics include cryptographic protocols, signature schemes, pseudo-random number generation, Shannon’s information theory, and stream ciphers.", "cred": "3", "p": null, "pre": ["CS 350"]}, {"depart": "CS", "id": "586", "name": "Introduction to Database Management Systems", "desc": "Introduction to fundamental concepts of database management using primarily the relational model. Schema design and refinement. Query languages. Database application environments. Physical data organization. Overview of query optimization and processing, physical design, recovery and concurrency control. Query processing for search engines. The course will cover topics such as security, data warehousing and analytic databases. Students will present a report on an advanced topic.", "cred": "3", "p": null, "pre": ["CS 161", "CS 251"]}, {"depart": "CS", "id": "587", "name": "Database Management Systems Implementation", "desc": "Internal design of a relational database management system. Concurrency control; lock managers; crash recovery; query and operator evaluation; query optimization; storage management; index structures; system catalogs.", "cred": "3", "p": null, "pre": ["CS 486", "CS 333"]}, {"depart": "CS", "id": "589", "name": "Principles of Database Systems", "desc": "This course explores the foundations of database systems, with a focus on data models and query languages. It will show how formal methods are applied to issues in database design and processing. Topics may include query formalisms and their equivalence, query transformation, semi-structured data models, dependencies and normal forms, logic and deductive databases, data language complexity, treatment of incomplete information, complex-value models, semantic models and classification, and temporal databases.", "cred": "3", "p": null, "pre": ["CS 386", "CS 586", "CS 250", "CS 251", "Mth 356"]}, {"depart": "CS", "id": "591", "name": "Introduction to Computer Security", "desc": "Provides a broad overview of computer security. Provides a solid theoretical foundation, as well as real-world examples, for understanding computer security. Fundamental theoretical results, foundational models, and salient examples will be covered. Security in computer operating systems, networks, and data will be covered, with emphasis on operating system and program security.", "cred": "3", "p": null, "pre": ["CS 333"]}, {"depart": "CS", "id": "592", "name": "Malware", "desc": "This course will study the motivations of malicious   code developers and the common weaknesses exploited by such code. The   course will then examine the identification and remedy of malicious   code.", "cred": "3", "p": null, "pre": []}, {"depart": "CS", "id": "593", "name": "Digital Forensics", "desc": "Detailed, hands-on approach to the investigation of criminal incidents in which computers or computer technology play a significant or interesting role. Familiarization with the core computer science theory and practical skills necessary to perform rudimentary computer forensic investigations, understanding the role of technology in investigating computer-based crime, and preparation to deal with investigative bodies.", "cred": "3", "p": null, "pre": []}, {"depart": "CS", "id": "594", "name": "Internetworking Protocols", "desc": "Advanced study of the protocols and algorithms used in the Internet (IETF) family of networking protocols. For example, ARP, IP, UDP, TCP, multicasting, routing protocols like RIP and OSPF, and application protocols like DNS, NFS, SNMP, FTP and HTTP. Issues such as addressing, name service, protocol design, and scaleability will be explored.", "cred": "3", "p": null, "pre": ["CS 333"]}, {"depart": "CS", "id": "597", "name": "Sensor Networks", "desc": "Foundations of sensor networks, with a focus on activity-based learning through a sequence of hands-on programming exercises with embedded devices with a high-level programming language. Basic building blocks in designing and deploying a sensor network application. Positioning and time synchronization of networked sensor devices, wireless communication characteristics of low-powered radios, energy conservation and harvesting, macro-programming a network of sensor devices and security.", "cred": "3", "p": null, "pre": []}, {"depart": "CS", "id": "598", "name": "Introduction to Wireless Network Protocols", "desc": "Introduction to wireless networking concepts at the physical, Mac (Medium Access Control) and higher layers; develop an understanding of 802.11 family of protocols; examine cellular standards like 3G and 4G LET; examples of evolving applications of wifi;", "cred": "3", "p": null, "pre": ["CS 333"]}, {"depart": "CS", "id": "610", "name": "Top: Computational Photography", "desc": "Computational photography is a field where computer  graphics, vision, optics, and photography come together to create  high-quality pictures. This course will discuss computational techniques  to overcome the limitations of traditional cameras and enhance their  capabilities. This course will cover topics ranging from concepts of  digital camera and photography to computer vision and graphics  techniques for creating high-quality pictures, including high dynamic  range imaging, panorama stitching, image segmentation & matting,  video stabilization, etc. Course website", "cred": "3", "p": null, "pre": ["CS 202"]}, {"depart": "CS", "id": "669", "name": "Scholarship Skills", "desc": "The purpose of this course is to make participants better scholars in Computer Science. In particular it attempts to help students become better researchers, better writers, better presenters, and better reviewers. It concentrates on reading, writing and composition skills", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "095", "name": "Intermediate Algebra\r\n", "desc": "Topics include problem solving, linear equations, systems of equations, polynomials and factoring techniques, rational expressions, radicals and exponents, quadratic equations. Credit for enrollment (eligibility) but not toward graduation; satisfies no University or general education requirements.", "cred": "4", "p": null, "pre": []}, {"depart": "\nMth", "id": "105", "name": "Excursions in Mathematics\r\n", "desc": "Exploration of a variety of modern mathematical topics. Topics may include the mathematics of voting systems, graphs and networks, symmetry in art and nature, population growth, fractals, probability. Intended for students without a strong algebra/calculus background, but with a desire to explore some interesting mathematics.", "cred": "4", "p": null, "pre": []}, {"depart": "\nMth", "id": "111", "name": "Introductory College Mathematics I\r\n", "desc": "Introduction to functions, basic properties, graphs and inverse functions.  Study of polynomial, rational, exponential, and logarithmic functions. This is the first course in a sequence of two: Mth 111 and Mth 112, which must be taken in sequence.", "cred": "4", "p": null, "pre": ["Mth 095"]}, {"depart": "\nMth", "id": "112", "name": "Introductory College Mathematics II\r\n", "desc": "Introduction to trigonometric functions, basic properties, graphs, and inverse functions.  Includes introduction to vectors, parametric equations, and polar coordinates. This is the second course in a sequence of two: Mth 111 and Mth 112, which must be taken in sequence.", "cred": "4", "p": null, "pre": ["Mth 111"]}, {"depart": "\nMth", "id": "191", "name": "Mathematics Tutoring\r\n", "desc": "Training in one-to-one and small-group tutoring over a wide range of mathematical topics. Mth 191: tutoring in arithmetic and other non-university courses. Mth 192: tutoring in freshman-level mathematics. Mth 193: tutoring in sophomore junior- and senior-level mathematics. Required field work consists of providing tutoring service in the community or University. This is the first course in a sequence of three: Mth 191, Mth 192, and Mth 193. Recommended prerequisite: consent of instructor.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "192", "name": "Mathematics Tutoring\r\n", "desc": "Training in one-to-one and small-group tutoring over a wide range of mathematical topics. Mth 191: tutoring in arithmetic and other non-university courses. Mth 192: tutoring in freshman-level mathematics. Mth 193: tutoring in sophomore junior- and senior-level mathematics. Required field work consists of providing tutoring service in the community or University. This is the second course in a sequence of three: Mth 191, Mth 192, and Mth 193. Recommended prerequisite: consent of instructor.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "193", "name": "Mathematics Tutoring\r\n", "desc": "Training in one-to-one and small-group tutoring over a wide range of mathematical topics. Mth 191: tutoring in arithmetic and other non-university courses. Mth 192: tutoring in freshman-level mathematics. Mth 193: tutoring in sophomore junior- and senior-level mathematics. Required field work consists of providing tutoring service in the community or University. This is the third course in a sequence of three: Mth 191, Mth 192, and Mth 193. Recommended prerequisite: consent of instructor.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "199", "name": "Special Studies\r\n", "desc": "(Credit to be arranged.)", "cred": "4", "p": null, "pre": []}, {"depart": "\nMth", "id": "211", "name": "Foundations Of Elementary Mathematics I\r\n", "desc": "A constructivist approach to fundamental ideas of mathematics for prospective K-8 teachers. Topics include numeration, operations, number theory, and problem solving. This is the first course in a sequence of three: Mth 211, Mth 212, and Mth 213.", "cred": "4", "p": null, "pre": []}, {"depart": "\nMth", "id": "212", "name": "Foundations Of Elementary Mathematics II\r\n", "desc": "A constructivist approach to fundamental ideas of mathematics for prospective K-8 teachers. Topics include rational numbers, probability, and statistics. This is the second course in a sequence of three: Mth 211, Mth 212, and Mth 213.", "cred": "4", "p": null, "pre": ["Mth 211"]}, {"depart": "\nMth", "id": "213", "name": "Foundations Of Elementary Mathematics III\r\n", "desc": "A constructivist approach to fundamental ideas of mathematics for prospective K-8 teachers. Topics include algebra, geometry, and measurement. This is the third course in a sequence of three: Mth 211, Mth 212, and Mth 213.", "cred": "4", "p": null, "pre": ["Mth 211"]}, {"depart": "\nMth", "id": "251", "name": "Calculus I\r\n", "desc": "Differential calculus of functions of a single variable, including limits, the definition and computation of the derivative, and applications of the derivative. This is the first course in a sequence of three: Mth 251, Mth 252, and Mth 253, which must be taken in sequence.", "cred": "4", "p": null, "pre": ["Mth 112"]}, {"depart": "\nMth", "id": "251R", "name": "Recitation Mth 251\r\n", "desc": "Recitation for Mth 251.", "cred": "0", "p": null, "pre": []}, {"depart": "\nMth", "id": "252", "name": "Calculus II\r\n", "desc": "Integral calculus of functions of a single variable, including the Fundamental Theorem of Calculus, numerical integration and applications.  This is the second course in a sequence of three: Mth 251, Mth 252, and Mth 253, which must be taken in sequence.", "cred": "4", "p": null, "pre": ["Mth 251"]}, {"depart": "\nMth", "id": "253", "name": "Calculus III\r\n", "desc": "Infinite series, parametric equations, polar coordinates, conic sections, vector geometry, and the calculus of vector valued functions.  This is the third course in a sequence of three: Mth 251, Mth 252, and Mth 253, which must be taken in sequence.", "cred": "4", "p": null, "pre": ["Mth 252"]}, {"depart": "\nMth", "id": "254", "name": "Calculus IV\r\n", "desc": "An introduction to differential and integral calculus of functions of several variables and applications.", "cred": "4", "p": null, "pre": ["Mth 253", "Mth 252", "Mth 261"]}, {"depart": "\nMth", "id": "256", "name": "Applied Ordinary Differential Equations\r\n", "desc": "Solution techniques in ordinary differential equations; applications.", "cred": "4", "p": null, "pre": ["Mth 252", "Mth 261"]}, {"depart": "\nMth", "id": "261", "name": "Introduction to Linear Algebra\r\n", "desc": "Systems of linear equations, linear transformations, matrix algebra, vector spaces, and determinants.", "cred": "4", "p": null, "pre": ["Mth 251"]}, {"depart": "\nMth", "id": "261R", "name": "Recitation for Mth 261\r\n", "desc": "Recitation for Mth 261.", "cred": "0", "p": null, "pre": []}, {"depart": "\nMth", "id": "271", "name": "Mathematical Computing\r\n", "desc": "Machine representation of the real number field and its consequences. Elements of error analysis. Introduction to the design, analysis, and stability of algorithms. Well/ill-conditioned problems. Programming, graphics, numeric and symbolic computations in MATLAB (a high level programming environment). Examples and applications in mathematics, science, and engineering.", "cred": "4", "p": null, "pre": ["Mth 253", "Mth 261"]}, {"depart": "\nMth", "id": "299", "name": "Special Studies\r\n", "desc": "(Credit to be arranged.)", "cred": "4", "p": null, "pre": []}, {"depart": "\nMth", "id": "300", "name": "Introduction to Mathematical Reasoning\r\n", "desc": "Fundamental abstract concepts common to all branches of mathematics, including first order predicate calculus, sets and functions, and elements from group theory and the foundations of analysis. Special emphasis is placed on the ability to understand and construct rigorous proofs.", "cred": "4", "p": null, "pre": ["Mth 253", "Mth 261"]}, {"depart": "\nMth", "id": "301", "name": "Elements of Modern Mathematics I\r\n", "desc": "Topics selected from arithmetic, algebra, geometry, calculus, probability, and statistics. A cultural approach to mathematics in which technical proficiency is not the primary objective. Recommended for liberal arts students.", "cred": "4", "p": null, "pre": ["Mth 111"]}, {"depart": "\nMth", "id": "302", "name": "Elements of Modern Mathematics II\r\n", "desc": "Topics selected from arithmetic, algebra, geometry, calculus, probability, and statistics. A cultural approach to mathematics in which technical proficiency is not the primary objective. Recommended for liberal arts students.", "cred": "4", "p": null, "pre": ["Mth 111"]}, {"depart": "\nMth", "id": "303", "name": "Elements of Modern Mathematics III\r\n", "desc": "Topics selected from arithmetic, algebra, geometry, calculus, probability, and statistics. A cultural approach to mathematics in which technical proficiency is not the primary objective. Recommended for liberal arts students.", "cred": "4", "p": null, "pre": ["Mth 111"]}, {"depart": "\nMth", "id": "311", "name": "Introduction to Mathematical Analysis I\r\n", "desc": "A rigorous treatment of the concepts of analysis. Properties of the real numbers. Sequences. Functions of a real variable: limits, continuity, and differentiability. This is the first course in a sequence of two: Mth 311, Mth 312 and must be taken in sequence.", "cred": "4", "p": null, "pre": ["Mth 253"]}, {"depart": "\nMth", "id": "312", "name": "Introduction to Mathematical Analysis II\r\n", "desc": "A rigorous treatment of the concepts of analysis. Integration on the real line. Series of real numbers. Series of functions. Uniform convergence. Power series. This is the second course in a sequence of two: Mth 311, Mth 312 and must be taken in sequence.", "cred": "4", "p": null, "pre": ["Mth 311"]}, {"depart": "\nMth", "id": "313", "name": "Advanced Multivariate Calculus\r\n", "desc": "Differential and integral calculus of functions of several variables, the inverse and implicit function theorems, vector field theory, line and surface integrals, Green’s, Stokes’, and Gauss’ theorems.", "cred": "4", "p": null, "pre": ["Mth 254", "Mth 312"]}, {"depart": "\nMth", "id": "322", "name": "Applied Partial Differential Equations\r\n", "desc": "Introduction to equations of mathematical physics, in particular, linear and nonlinear advection equation, wave equation, initial and boundary value problems, method of characteristics, separation of variables.", "cred": "4", "p": null, "pre": ["Mth 256"]}, {"depart": "\nMth", "id": "324", "name": "Vector Analysis\r\n", "desc": "Modern vector methods with applications for students of mathematics, physics, and engineering.", "cred": "4", "p": null, "pre": ["Mth 254"]}, {"depart": "\nMth", "id": "338", "name": "Modern College Geometry\r\n", "desc": "Topics in Euclidean and non-Euclidean geometry.", "cred": "4", "p": null, "pre": ["Mth 252", "Mth 261"]}, {"depart": "\nMth", "id": "343", "name": "Applied Linear Algebra\r\n", "desc": "Topics in matrix algebra, determinants, systems of linear equations, eigenvalues, eigenvectors, and linear transformations. Selected applications from science, engineering, computer science, and business.", "cred": "4", "p": null, "pre": ["Mth 252", "Mth 261"]}, {"depart": "\nMth", "id": "344", "name": "Introduction to Group Theory and Applications\r\n", "desc": "Groups, homomorphisms, factor groups. Selected applications from geometry, combinatorics, computer science, chemistry.", "cred": "4", "p": null, "pre": ["Mth 252", "Mth 261"]}, {"depart": "\nMth", "id": "345", "name": "Introduction to Ring and Field Theory\r\n", "desc": "Topics in rings, integral domains, fields, ordered fields, polynomial rings. The development of the real number system.", "cred": "4", "p": null, "pre": ["Mth 344"]}, {"depart": "\nMth", "id": "346", "name": "Number Theory\r\n", "desc": "A presentation of the properties of numbers as found in the theory of divisibility, congruence, diophantine equations, continued fractions, and algebraic numbers.", "cred": "4", "p": null, "pre": ["Mth 252", "Mth 261"]}, {"depart": "\nMth", "id": "356", "name": "Discrete Mathematics\r\n", "desc": "Topics in discrete mathematics, including propositional logic, sets, relations, inverse functions, divisibility, induction, recurrences, inclusion-exclusion, permutations, combinations, graphs, graph coloring, and applications. Expected preparation: MTH 261.", "cred": "4", "p": null, "pre": ["Mth 253"]}, {"depart": "\nMth", "id": "399", "name": "Special Studies\r\n", "desc": "(Credit to be arranged.)", "cred": "6", "p": null, "pre": []}, {"depart": "\nMth", "id": "399U", "name": "Special Studies\r\n", "desc": "(Credit to be arranged.)", "cred": "4", "p": null, "pre": []}, {"depart": "\nMth", "id": "401", "name": "Research\r\n", "desc": "(Credit to be arranged.) Consent of instructor.", "cred": "6", "p": null, "pre": []}, {"depart": "\nMth", "id": "402\n", "name": "", "desc": "", "cred": "12", "p": null, "pre": []}, {"depart": "\nMth", "id": "404", "name": "Cooperative Education/Internship\r\n", "desc": "(Credit to be arranged.)", "cred": "12", "p": null, "pre": []}, {"depart": "\nMth", "id": "405", "name": "Reading and Conference\r\n", "desc": "(Credit to be arranged.) Consent of instructor.", "cred": "6", "p": null, "pre": []}, {"depart": "\nMth", "id": "407", "name": "Seminar\r\n", "desc": "(Credit to be arranged.) Consent of instructor.", "cred": "6", "p": null, "pre": []}, {"depart": "\nMth", "id": "410", "name": "Selected Topics\r\n", "desc": "(Credit to be arranged.) Consent of instructor.", "cred": "6", "p": null, "pre": []}, {"depart": "\nMth", "id": "411", "name": "Introduction to Real Analysis I\r\n", "desc": "Analysis on metric spaces, Baire Category, Contraction Mapping, and Stone-Weierstrass theorems. This is the first course in a sequence of three: Mth 411, Mth 412 and Mth 413 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 312"]}, {"depart": "\nMth", "id": "412", "name": "Introduction to Real Analysis II\r\n", "desc": "Lebesgue measure and integration theory, functions of bounded variation, absolutely continuous functions. This is the second course in a sequence of three: Mth 411, Mth 412 and Mth 413 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 411"]}, {"depart": "\nMth", "id": "413", "name": "Introduction to Real Analysis III\r\n", "desc": "Banach and Hilbert spaces, bases and duality in Hilbert spaces, linear operators on Banach spaces, introduction to Fourier series. This is the third course in a sequence of three: Mth 411, Mth 412 and Mth 413 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 412"]}, {"depart": "\nMth", "id": "420", "name": "Introduction to Complexity Theory\r\n", "desc": "An introduction to theoretical computer science. Includes a study of models of computation, complexity classes, Cook's theorem, polynomial and nonpolynomial classes, discrete problems.", "cred": "3", "p": null, "pre": ["Mth 344"]}, {"depart": "\nMth", "id": "421", "name": "Theory of Ordinary Differential Equations I\r\n", "desc": "Vector fields and phase flows in the plane. Linear systems. Existence, uniqueness, and continuity theorems for systems. Additional topics. This is the first course in a sequence of three: Mth 421, Mth 422, and Mth 423 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 256", "Mth 312"]}, {"depart": "\nMth", "id": "422", "name": "Theory of Ordinary Differential Equations II\r\n", "desc": "Nonlinear systems. Equilibria and local stability. Gradient and Hamiltonian systems.  Poincare maps and limit sets. Applications and additional topics. This is the second course in a sequence of three: Mth 421, Mth 422, and Mth 423 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 421"]}, {"depart": "\nMth", "id": "423", "name": "Theory of Ordinary Differential Equations III\r\n", "desc": "The two-body problem. The Lorenz system. Homoclinic bifurcations. Chaotic attractors. Horseshoes. Symbolic dynamics and the shift map. Discrete dynamics. Additional topics. This is the third course in a sequence of three: Mth 421, Mth 422, and Mth 423 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 422"]}, {"depart": "\nMth", "id": "424", "name": "Elementary Differential Geometry I\r\n", "desc": "Differential geometry of curves and surfaces: parametrizations, global properties of curves, surfaces of dimension three, examples, first and second fundamental form, curvature, geodesics. This is the first course in a sequence of two: Mth 424 and Mth 425 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 421", "Mth 254", "Mth 256"]}, {"depart": "\nMth", "id": "425", "name": "Elementary Differential Geometry II\r\n", "desc": "Surfaces of constant curvature, the Gauss-Bonnet theorem; spherical and hyperbolic geometry, elementary Riemannian geometry applications from mechanics and field theory. This is the second course in a sequence of two: Mth 424 and Mth 425 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 424"]}, {"depart": "\nMth", "id": "427", "name": "Partial Differential Equations I\r\n", "desc": "Solution techniques, qualitative analysis and applications: separation of variables, eigenfunction expansion, Fourier series solutions, Sturm-Liouville problems. This is the first course in a sequence of two: Mth 427 and Mth 428 which must be taken in sequence. Prior knowledge of PDEs (Mth 322) is recommended, but not required.", "cred": "3", "p": null, "pre": ["Mth 256", "Mth 253", "Mth 254"]}, {"depart": "\nMth", "id": "428", "name": "Partial Differential Equations II\r\n", "desc": "Higher dimensional equations, heat conduction in a disk, vibrating membrane, spherical problems, Bessel and Legendre functions, Green’s functions, Fredholm alternative.  Infinite domain problems, Fourier transform solutions, finite difference methods. This is the second course in a sequence of two: Mth 427 and Mth 428 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 427"]}, {"depart": "\nMth", "id": "430", "name": "Topics in Mathematical Modeling\r\n", "desc": "Basic introduction to mathematical model building starting with prototype, model purpose definition, and model validation. Models will be chosen from life, the physical and social sciences. Applications chosen from differential equations, linear programming, group theory, probability or other fields. With approval, this course may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 256", "Mth 421", "Mth 521"]}, {"depart": "\nMth", "id": "431", "name": "Topics in Geometry I\r\n", "desc": "Topics selected from projective geometry, non-Euclidean geometry, algebraic geometry, convexity, differential geometry, foundations of geometry, combinatorial topology. This is the first course in a sequence of three: Mth 431, Mth 432, and Mth 433; with departmental approval, this sequence may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 311", "Mth 338", "Mth 344"]}, {"depart": "\nMth", "id": "432", "name": "Topics in Geometry II\r\n", "desc": "Topics selected from projective geometry, non-Euclidean geometry, algebraic geometry, convexity, differential geometry, foundations of geometry, combinatorial topology. This is the second course in a sequence of three: Mth 431, Mth 432, and Mth 433; with departmental approval, this sequence may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 311", "Mth 338", "Mth 344"]}, {"depart": "\nMth", "id": "433", "name": "Topics in Geometry III\r\n", "desc": "Topics selected from projective geometry, non-Euclidean geometry, algebraic geometry, convexity, differential geometry, foundations of geometry, combinatorial topology. This is the third course in a sequence of three: Mth 431, Mth 432, and Mth 433; with departmental approval, this sequence may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 311", "Mth 338", "Mth 344"]}, {"depart": "\nMth", "id": "434", "name": "Set Theory and Topology I\r\n", "desc": "DeMorgan’s Laws, partially ordered and well-ordered sets, Cardinal and ordinal numbers. The axiom of choice and equivalent formulations. Additional topics. This is the first course in a sequence of three: Mth 434, Mth 435, and Mth 436 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 311"]}, {"depart": "\nMth", "id": "435", "name": "Set Theory and Topology II\r\n", "desc": "Introduction to general topology with the notions of interior, closure, topological space, continuity, and homeomorphism. Construction techniques and properties of point-set topology, especially connectedness, compactness, and separation. This is the second course in a sequence of three: Mth 434, Mth 435, and Mth 436 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 434"]}, {"depart": "\nMth", "id": "436", "name": "Set Theory and Topology III\r\n", "desc": "Covering spaces, fundamental group. Additional topics. This is the third course in a sequence of three: Mth 434, Mth 435, and Mth 436 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 435"]}, {"depart": "\nMth", "id": "440", "name": "Boolean Algebra\r\n", "desc": "Axiomatic treatment of Boolean algebras, finite Boolean algebras, representation theorems. Introduction to partially ordered sets and lattices. Transfinite induction, Zorn's lemma. Applications to logic and switching circuits.", "cred": "4", "p": null, "pre": ["Mth 344"]}, {"depart": "\nMth", "id": "441", "name": "Introduction to Abstract Algebra I\r\n", "desc": "Group theory and homomorphism theorems. This is the first course in a sequence of three: Mth 441, Mth 442, and Mth 443 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 344"]}, {"depart": "\nMth", "id": "442", "name": "Introduction to Abstract Algebra II\r\n", "desc": "The theory of rings, modules, and fields. This is the second course in a sequence of three: Mth 441, Mth 442, and Mth 443 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 441"]}, {"depart": "\nMth", "id": "443", "name": "Introduction to Abstract Algebra III\r\n", "desc": "Topics may include: advanced theory of groups, rings, and fields, as well as linear algebra or Galois theory. This is the third course in a sequence of three: Mth 441, Mth 442, and Mth 443 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 442"]}, {"depart": "\nMth", "id": "444", "name": "Advanced Linear/Multilinear Algebra I\r\n", "desc": "Vector spaces, linear transformations, matrices, products, quotients, and duals of vector spaces. Minimal and characteristic polynomials, canonical forms. This is the first course in a sequence of two: Mth 444 and Mth 445 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 344"]}, {"depart": "\nMth", "id": "445", "name": "Advanced Linear/Multilinear Algebra II\r\n", "desc": "Multilinear maps, tensor products, exterior algebra. Finite dimensional spectral theory. This is the second course in a sequence of two: Mth 444 and Mth 445 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 444"]}, {"depart": "\nMth", "id": "449", "name": "Topics in Advanced Number Theory\r\n", "desc": "A study of advanced topics selected from the areas of algebraic or analytic theory. With departmental approval, this course may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 346"]}, {"depart": "\nMth", "id": "451", "name": "Numerical Calculus I\r\n", "desc": "Computer arithmetic. Solution of nonlinear equations. Interpolation. Numerical integration and differentiation. Solution of linear equation systems. Eigenvalue problem, least square, Chebyshev, trigonometric and rational function approximation. Numerical solution of differential equations. This is the first course in a sequence of three: Mth 451, Mth 452, and Mth 453 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 253", "Mth 261"]}, {"depart": "\nMth", "id": "452", "name": "Numerical Calculus II\r\n", "desc": "Computer arithmetic. Solution of nonlinear equations. Interpolation. Numerical integration and differentiation. Solution of linear equation systems. Eigenvalue problem, least square, Chebyshev, trigonometric and rational function approximation. Numerical solution of differential equations. This is the second course in a sequence of three: Mth 451, Mth 452, and Mth 453 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 253", "Mth 261"]}, {"depart": "\nMth", "id": "453", "name": "Numerical Calculus III\r\n", "desc": "Computer arithmetic. Solution of nonlinear equations. Interpolation. Numerical integration and differentiation. Solution of linear equation systems. Eigenvalue problem, least square, Chebyshev, trigonometric and rational function approximation. Numerical solution of differential equations. This is the third course in a sequence of three: Mth 451, Mth 452, and Mth 453 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 253", "Mth 261"]}, {"depart": "\nMth", "id": "456", "name": "Topics in Combinatorics\r\n", "desc": "Selected topics from: permutations, combinations, partitions, generating functions, inclusion/exclusion, recursion, Polya counting, block designs, orthogonal polynomials, and error-correcting codes. With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 356", "CS 251"]}, {"depart": "\nMth", "id": "457", "name": "The Mathematical Theory of Games I\r\n", "desc": "Introduction to mathematical game theory and game theoretic analysis. Topics include: combinatorial and strategic games, Perfect Competition, Zermelo's Algorithm, Payoffs, cooperative and non-cooperative games, bargaining, mixed strategies, and Nash Equilibria, Selected applications to economics, biology, computer science, and political science. This is the first course in a sequence of two: Mth 457 and Mth 458 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 261", "Stat 243"]}, {"depart": "\nMth", "id": "458", "name": "The Mathematical Theory of Games II\r\n", "desc": "Introduction to mathematical game theory and game theoretic analysis. Topics include: Dilemma, search, and differential games. Repeated games and finite automata. Common knowledge, complete and incomplete information, behavioral and evolutionary stable strategies, assessment equilibria. Selected applications to economics, biology, computer science, and political science. This is the second course in a sequence of two: Mth 457 and Mth 458 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 457"]}, {"depart": "\nMth", "id": "461", "name": "Graph Theory I\r\n", "desc": "Topics in graph theory, including connectivity, matchings, graph algorithms, network flows, isomorphisms, Eulerian graphs, spanning trees, decompositions, shortest paths, colorings of graphs, and selected applications. This is the first course in a sequence of two: Mth 461 and Mth 462 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 261", "Mth 356"]}, {"depart": "\nMth", "id": "462", "name": "Graph Theory II\r\n", "desc": "Topics in graph theory, including graph matrices, Hamiltonian graphs, the matrix-tree theorem, planarity and embeddings, Kuratowski's theorem, matroids, and selected applications. This is the second course in a sequence of two: Mth 461 and Mth 462 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 461"]}, {"depart": "\nMth", "id": "470", "name": "Complex Analysis and Boundary Value Problems I\r\n", "desc": "Fundamental concepts of complex analysis.   Cauchy’s theorem. Analytic functions.  Power and Laurent series.  Residue Theorem. This is the first course in a sequence of three: Mth 470, Mth 471, and Mth 472 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 254", "Mth 256", "Mth 421"]}, {"depart": "\nMth", "id": "471", "name": "Complex Analysis and Boundary Value Problems II\r\n", "desc": "Fundamental concepts of complex analysis.  Calculus of residues and applications. Conformal mappings. Zero-Pole theorem. Infinite products.  This is the second course in a sequence of three: Mth 470, Mth 471, and Mth 472. which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 470"]}, {"depart": "\nMth", "id": "472", "name": "Complex Analysis and Boundary Value Problems III\r\n", "desc": "Partial differential equations and boundary value problems using Fourier series. This is the third course in a sequence of three: Mth 470, Mth 471, and Mth 472 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 471"]}, {"depart": "\nMth", "id": "477", "name": "Mathematical Control Theory I\r\n", "desc": "Mathematical foundations of linear time invariant control systems. Controllability, observability, stabilizability, feedback. Applications. This is the first course in a sequence of two: Mth 477 and Mth 478, which must be taken in sequence.  Expected preparation: Mth 253, Mth 254.", "cred": "3", "p": null, "pre": ["Mth 256"]}, {"depart": "\nMth", "id": "478", "name": "Mathematical Control Theory II\r\n", "desc": "Elements of the calculus of variations and optimal control. Dynamic programming. Pontryagin maximum principle. Applications. This is the second course in a sequence of two: Mth 477 and Mth 478 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 477"]}, {"depart": "\nMth", "id": "480", "name": "Systems Analysis: Calculus of Variations\r\n", "desc": "Basic problems of the calculus of variations. Euler equations. Lagrange conditions. Lagrange multipliers. Lagrange equations. Hamilton's equations. Application to mechanical and electrical systems.", "cred": "3", "p": null, "pre": ["Mth 256", "Mth 422", "Mth 522"]}, {"depart": "\nMth", "id": "481", "name": "Topics in Probability for Mathematics Teachers\r\n", "desc": "Selected topics in probability for mathematics teachers. Topics may include origins and development of probability theory, counting theory, laws of probability, conditional probability, independence, odds, standard discrete and continuous probability distributions, expected values, moment generating functions, and numerous computer simulations.  With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Stat 244", "Stat 452", "Stat 462"]}, {"depart": "\nMth", "id": "482", "name": "Topics in Statistics for Mathematics Teachers\r\n", "desc": "Selected topics in statistics for mathematics teachers.  Potential topics include descriptive statistics (measures of center, variability, skewness, etc.), inferential statistics (one and two population problems), Central Limit Theorem, modeling and simulation techniques, and research design techniques. With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Stat 244", "Stat 452", "Stat 462"]}, {"depart": "\nMth", "id": "483", "name": "Topics in Geometry for Mathematics Teachers\r\n", "desc": "Selected topics in geometry for mathematics teachers.  Potential topics include inductive and deductive reasoning, analytic and metric geometry, isometry and symmetry, and hyperbolic, spherical and/or taxicab geometry.  With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 338"]}, {"depart": "\nMth", "id": "484", "name": "Topics in Algebra for Mathematics Teachers\r\n", "desc": "Selected topics in algebra for mathematics teachers.  Potential topics may include algebraic structures (groups, rings, fields, vector spaces), equivalence, function, operation, well-defined-ness, equation solving, algorithms, and proving using geometric, symbolic, and verbal representation systems.  With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 344"]}, {"depart": "\nMth", "id": "485", "name": "Topics in Analysis for Mathematics Teachers\r\n", "desc": "Selected topics in analysis for mathematics teachers.  Potential topics include functions, limits, continuity, derivatives, integration, completeness, covariation, sequences and series, differential equations, complex analysis, and topology.  With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 311"]}, {"depart": "\nMth", "id": "486", "name": "Topics in The History of Mathematics\r\n", "desc": "Selected topics in the historical development of mathematics. With departmental approval, this course may be repeated for credit.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "487", "name": "Topics in Discrete Mathematics for Mathematics Teachers\r\n", "desc": "Selected topics in discrete mathematics for teachers. Potential topics include set theory, logic, elementary probability theory, relations, recursions, algorithms, counting theory, permutations, finance mathematics, combinations, graph theory, algorithms, logic, and number theory.  With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 356"]}, {"depart": "\nMth", "id": "488", "name": "Topics in Computing for Mathematics Teachers\r\n", "desc": "Selected topics and tools for mathematical computing for mathematics teachers.  As an example, a simple but powerful set of programming and graphical tools  in ‘C’ may be introduced and used to explore a wide range of mathematical topics including statistics, probability, trigonometry, analytic geometry, calculus and modeling. With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 271", "CS 161", "Mth 344"]}, {"depart": "\nMth", "id": "491", "name": "Experimental Probability and Statistics for Middle School Teachers\r\n", "desc": "A study of probability and statistics through laboratory experiments, simulations, and applications, with integration of problem solving and technology. Not approved for major credit. Available for graduate credit toward the graduate certificate program in middle school mathematics.", "cred": "4", "p": null, "pre": ["Mth 112", "Mth 212", "Mth 213"]}, {"depart": "\nMth", "id": "493", "name": "Geometry for Middle School Teachers\r\n", "desc": "Selected topics from informal geometry, both two- and three-dimensional, with integration of problem solving and technology. Not approved for major credit. Available for graduate credit toward the graduate certificate program in middle school mathematics.", "cred": "4", "p": null, "pre": ["Mth 112", "Mth 212", "Mth 213"]}, {"depart": "\nMth", "id": "494", "name": "Arithmetic and Algebraic Structures for Middle School Teachers\r\n", "desc": "The study of the real number system and its subsystems will lead to the introduction of more general algebraic structures and their applications, with focus on problem solving. Not approved for major credit. Available for graduate credit toward the graduate certificate program in middle school mathematics.", "cred": "4", "p": null, "pre": ["Mth 212", "Mth 213"]}, {"depart": "\nMth", "id": "495", "name": "Historical Topics in Mathematics for Middle School Teachers\r\n", "desc": "A survey of the historical development of topics in mathematics from ancient to modern times, with special emphasis on topics in arithmetic, algebra and informal geometry, and with integration of problem solving and technology. Not approved for major credit. Available for graduate credit toward the graduate certificate program in middle school mathematics.", "cred": "4", "p": null, "pre": ["Mth 112", "Mth 212", "Mth 213"]}, {"depart": "\nMth", "id": "496", "name": "Concepts of Calculus for Middle School Teachers\r\n", "desc": "An introduction to the limit concept and its role in defining the derivative, the integral and infinite series. Applications to middle school mathematics, with integration of problem solving and technology. Not approved for major credit. Available for graduate credit toward the graduate certificate program in middle school mathematics.", "cred": "4", "p": null, "pre": ["Mth 112", "Mth 212", "Mth 213"]}, {"depart": "\nMth", "id": "497", "name": "Mathematics in the Middle School Classroom\r\n", "desc": "A survey of mathematics taught in the middle school grades, with focus on both content and pedagogical recommendations of the National Council of Teachers of Mathematics, and with integration of problem solving and technology. Not approved for major credit. Available for graduate credit toward the graduate certificate program in mathematics for middle school teachers.", "cred": "4", "p": null, "pre": ["Mth 112", "Mth 212", "Mth 213"]}, {"depart": "\nMth", "id": "501", "name": "Research\r\n", "desc": "(Credit to be arranged.) Consent of instructor.", "cred": "9", "p": null, "pre": []}, {"depart": "\nMth", "id": "503", "name": "Thesis\r\n", "desc": "(Credit to be arranged.)", "cred": "9", "p": null, "pre": []}, {"depart": "\nMth", "id": "504", "name": "Cooperative Education/Internship\r\n", "desc": "(Credit to be arranged.)", "cred": "9", "p": null, "pre": []}, {"depart": "\nMth", "id": "505", "name": "Reading and Conference\r\n", "desc": "(Credit to be arranged.) Consent of instructor.", "cred": "4", "p": null, "pre": []}, {"depart": "\nMth", "id": "507", "name": "Seminar\r\n", "desc": "(Credit to be arranged.) Consent of instructor.", "cred": "6", "p": null, "pre": []}, {"depart": "\nMth", "id": "509", "name": "Practicum\r\n", "desc": "(Credit to be arranged.)", "cred": "9", "p": null, "pre": []}, {"depart": "\nMth", "id": "510", "name": "Selected Topics\r\n", "desc": "(Credit to be arranged.) Consent of instructor.", "cred": "6", "p": null, "pre": []}, {"depart": "\nMth", "id": "511", "name": "Introduction to Real Analysis I\r\n", "desc": "Analysis on metric spaces, Baire Category, Contraction Mapping, and Stone-Weierstrass theorems. This is the first course in a sequence of three: Mth 511, Mth 512 and Mth 513 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 312"]}, {"depart": "\nMth", "id": "512", "name": "Introduction to Real Analysis II\r\n", "desc": "Lebesgue measure and integration theory, functions of bounded variation, absolutely continuous functions. This is the second course in a sequence of three: Mth 511, Mth 512 and Mth 513 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 511"]}, {"depart": "\nMth", "id": "513", "name": "Introduction to Real Analysis III\r\n", "desc": "Banach and Hilbert spaces, bases and duality in Hilbert spaces, linear operators on Banach spaces, introduction to Fourier series. This is the third course in a sequence of three: Mth 511, Mth 512 and Mth 513 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 512"]}, {"depart": "\nMth", "id": "520", "name": "Introduction to Complexity Theory\r\n", "desc": "An introduction to theoretical computer science. Includes a study of models of computation, complexity classes, Cook's theorem, polynomial and nonpolynomial classes, discrete problems.", "cred": "3", "p": null, "pre": ["Mth 344"]}, {"depart": "\nMth", "id": "521", "name": "Theory of Ordinary Differential Equations I\r\n", "desc": "Vector fields and phase flows in the plane. Linear systems. Existence, uniqueness, and continuity theorems for systems. Additional topics. This is the first course in a sequence of three: Mth 521, Mth 522, and Mth 523 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 256", "Mth 312"]}, {"depart": "\nMth", "id": "522", "name": "Theory of Ordinary Differential Equations II\r\n", "desc": "Nonlinear systems. Equilibria and local stability. Gradient and Hamiltonian systems.  Poincare maps and limit sets. Applications and additional topics. This is the second course in a sequence of three: Mth 521, Mth 522, and Mth 523 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 521"]}, {"depart": "\nMth", "id": "523", "name": "Theory of Ordinary Differential Equations III\r\n", "desc": "The two-body problem. The Lorenz system. Homoclinic bifurcations. Chaotic attractors. Horseshoes. Symbolic dynamics and the shift map. Discrete dynamics. Additional topics. This is the third course in a sequence of three: Mth 521, Mth 522, and Mth 523 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 522"]}, {"depart": "\nMth", "id": "524", "name": "Elementary Differential Geometry I\r\n", "desc": "Differential geometry of curves and surfaces: parametrizations, global properties of curves, surfaces of dimension three, examples, first and second fundamental form, curvature, geodesics. This is the first course in a sequence of two: Mth 524 and Mth 525 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 521", "Mth 254", "Mth 256"]}, {"depart": "\nMth", "id": "525", "name": "Elementary Differential Geometry II\r\n", "desc": "Surfaces of constant curvature, the Gauss-Bonnet theorem; spherical and hyperbolic geometry, elementary Riemannian geometry applications from mechanics and field theory. This is the second course in a sequence of two: Mth 524 and Mth 525 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 524"]}, {"depart": "\nMth", "id": "527", "name": "Partial Differential Equations I\r\n", "desc": "Solution techniques, qualitative analysis and applications: separation of variables, eigenfunction expansion, Fourier series solutions, Sturm-Liouville problems. This is the first course in a sequence of two: Mth 527 and Mth 528 which must be taken in sequence. Prior knowledge of PDEs (Mth 322) is recommended, but not required.", "cred": "3", "p": null, "pre": ["Mth 256", "Mth 253", "Mth 254"]}, {"depart": "\nMth", "id": "528", "name": "Partial Differential Equations II\r\n", "desc": "Higher dimensional equations, heat conduction in a disk, vibrating membrane, spherical problems, Bessel and Legendre functions, Green’s functions, Fredholm alternative.  Infinite domain problems, Fourier transform solutions, finite difference methods. This is the second course in a sequence of two: Mth 527 and Mth 528 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 527"]}, {"depart": "\nMth", "id": "530", "name": "Topics in Mathematical Modeling\r\n", "desc": "Basic introduction to mathematical model building starting with prototype, model purpose definition, and model validation. Models will be chosen from life, the physical and social sciences. Applications chosen from differential equations, linear programming, group theory, probability or other fields. With approval, this course may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 256", "Mth 421", "Mth 521"]}, {"depart": "\nMth", "id": "531", "name": "Topics in Geometry I\r\n", "desc": "Topics selected from projective geometry, non-Euclidean geometry, algebraic geometry, convexity, differential geometry, foundations of geometry, combinatorial topology. This is the first course in a sequence of three: Mth 531, Mth 532, and Mth 533; with departmental approval, this sequence may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 311", "Mth 338", "Mth 344"]}, {"depart": "\nMth", "id": "532", "name": "Topics in Geometry II\r\n", "desc": "Topics selected from projective geometry, non-Euclidean geometry, algebraic geometry, convexity, differential geometry, foundations of geometry, combinatorial topology. This is the second course in a sequence of three: Mth 531, Mth 532, and Mth 533; with departmental approval, this sequence may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 311", "Mth 338", "Mth 344"]}, {"depart": "\nMth", "id": "533", "name": "Topics in Geometry III\r\n", "desc": "Topics selected from projective geometry, non-Euclidean geometry, algebraic geometry, convexity, differential geometry, foundations of geometry, combinatorial topology. This is the third course in a sequence of three: Mth 531, Mth 532, and Mth 533; with departmental approval, this sequence may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 311", "Mth 338", "Mth 344"]}, {"depart": "\nMth", "id": "534", "name": "Set Theory and Topology I\r\n", "desc": "DeMorgan’s Laws, partially ordered and well-ordered sets, Cardinal and ordinal numbers. The axiom of choice and equivalent formulations. Additional topics. This is the first course in a sequence of three: Mth 534, Mth 535, and Mth 536 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 311"]}, {"depart": "\nMth", "id": "535", "name": "Set Theory and Topology II\r\n", "desc": "Introduction to general topology with the notions of interior, closure, topological space, continuity, and homeomorphism. Construction techniques and properties of point-set topology, especially connectedness, compactness, and separation. This is the second course in a sequence of three:   Mth 534, Mth 535, and Mth 536 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 534"]}, {"depart": "\nMth", "id": "536", "name": "Set Theory and Topology III\r\n", "desc": "Covering spaces, fundamental group. Additional topics. This is the third course in a sequence of three:  Mth 534, Mth 535, and Mth 536 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 535"]}, {"depart": "\nMth", "id": "540", "name": "Boolean Algebra\r\n", "desc": "Axiomatic treatment of Boolean algebras, finite Boolean algebras, representation theorems. Introduction to partially ordered sets and lattices. Transfinite induction, Zorn's lemma. Applications to logic and switching circuits.", "cred": "4", "p": null, "pre": ["Mth 344"]}, {"depart": "\nMth", "id": "541", "name": "Introduction to Abstract Algebra I\r\n", "desc": "Group theory and homomorphism theorems. This is the first course in a sequence of three: Mth 541, Mth 542, and Mth 543 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 344"]}, {"depart": "\nMth", "id": "542", "name": "Introduction to Abstract Algebra II\r\n", "desc": "The theory of rings, modules, and fields. This is the second course in a sequence of three: Mth 541, Mth 542, and Mth 543 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 541"]}, {"depart": "\nMth", "id": "543", "name": "Introduction to Abstract Algebra III\r\n", "desc": "Topics may include: advanced theory of groups, rings, and fields, as well as linear algebra or Galois theory. This is the third course in a sequence of three: Mth 541, Mth 542, and Mth 543 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 542"]}, {"depart": "\nMth", "id": "544", "name": "Advanced Linear/Multilinear Algebra I\r\n", "desc": "Vector spaces, linear transformations, matrices, products, quotients, and duals of vector spaces. Minimal and characteristic polynomials, canonical forms. This is the first course in a sequence of two: Mth 544 and Mth 545 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 344"]}, {"depart": "\nMth", "id": "545", "name": "Advanced Linear/Multilinear Algebra II\r\n", "desc": "Multilinear maps, tensor products, exterior algebra. Finite dimensional spectral theory. This is the second course in a sequence of two: Mth 544 and Mth 545 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 544"]}, {"depart": "\nMth", "id": "549", "name": "Topics in Advanced Number Theory\r\n", "desc": "A study of advanced topics selected from the areas of algebraic or analytic theory. With departmental approval, this course may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 346"]}, {"depart": "\nMth", "id": "551", "name": "Numerical Calculus I\r\n", "desc": "Computer arithmetic. Solution of nonlinear equations. Interpolation. Numerical integration and differentiation. Solution of linear equation systems. Eigenvalue problem, least square, Chebyshev, trigonometric and rational function approximation. Numerical solution of differential equations. This is the first course in a sequence of three: Mth 551, Mth 552, and Mth 553 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 253", "Mth 261"]}, {"depart": "\nMth", "id": "552", "name": "Numerical Calculus II\r\n", "desc": "Computer arithmetic. Solution of nonlinear equations. Interpolation. Numerical integration and differentiation. Solution of linear equation systems. Eigenvalue problem, least square, Chebyshev, trigonometric and rational function approximation. Numerical solution of differential equations. This is the second course in a sequence of three: Mth 551, Mth 552, and Mth 553 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 253", "Mth 261"]}, {"depart": "\nMth", "id": "553", "name": "Numerical Calculus III\r\n", "desc": "Computer arithmetic. Solution of nonlinear equations. Interpolation. Numerical integration and differentiation. Solution of linear equation systems. Eigenvalue problem, least square, Chebyshev, trigonometric and rational function approximation. Numerical solution of differential equations. This is the third course in a sequence of three: Mth 551, Mth 552, and Mth 553 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 253", "Mth 261"]}, {"depart": "\nMth", "id": "556", "name": "Topics in Combinatorics\r\n", "desc": "Selected topics from: permutations, combinations, partitions, generating functions, inclusion/exclusion, recursion, Polya counting, block designs, orthogonal polynomials, and error-correcting codes. With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 356", "CS 251"]}, {"depart": "\nMth", "id": "557", "name": "The Mathematical Theory of Games I\r\n", "desc": "Introduction to mathematical game theory and game theoretic analysis. Topics include: combinatorial and strategic games, Perfect Competition, Zermelo's Algorithm, Payoffs, cooperative and non-cooperative games, bargaining, mixed strategies, and Nash Equilibria. Selected applications to economics, biology, computer science, and political science. This is the first course in a sequence of two: Mth 557 and Mth 558 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 261", "Stat 243"]}, {"depart": "\nMth", "id": "558", "name": "The Mathematical Theory of Games II\r\n", "desc": "Introduction to mathematical game theory and game theoretic analysis. Topics include: Dilemma, search, and differential games. Repeated games and finite automata. Common knowledge, complete and incomplete information, behavioral and evolutionary stable strategies, assessment equilibria. Selected applications to economics, biology, computer science, and political science. This is the second course in a sequence of two: Mth 557 and Mth 558 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 557"]}, {"depart": "\nMth", "id": "561", "name": "Graph Theory I\r\n", "desc": "Topics in graph theory, including connectivity, matchings, graph algorithms, network flows, isomorphisms, Eulerian graphs, spanning trees, decompositions, shortest paths, colorings of graphs, and selected applications. This is the first course in a sequence of two: Mth 561 and Mth 562 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 261", "Mth 356"]}, {"depart": "\nMth", "id": "562", "name": "Graph Theory II\r\n", "desc": "Topics in graph theory, including graph matrices, Hamiltonian graphs, the matrix-tree theorem, planarity and embeddings, Kuratowski's theorem, matroids, and selected applications. This is the second course in a sequence of two: Mth 561 and Mth 562 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 561"]}, {"depart": "\nMth", "id": "570", "name": "Complex Analysis and Boundary Value Problems I\r\n", "desc": "Fundamental concepts of complex analysis.  Cauchy’s theorem. Analytic functions.  Power and Laurent series.  Residue Theorem.  This is the first course in a sequence of three: Mth 570, Mth 571, and Mth 572  which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 254", "Mth 256", "Mth 421", "Mth 521"]}, {"depart": "\nMth", "id": "571", "name": "Complex Analysis and Boundary Value Problems II\r\n", "desc": "Fundamental concepts of complex analysis.  Calculus of residues and applications. Conformal mappings. Zero-Pole theorem. Infinite products. This is the second course in a sequence of three: Mth 570, Mth 571, and Mth 572 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 570"]}, {"depart": "\nMth", "id": "572", "name": "Complex Analysis and Boundary Value Problems III\r\n", "desc": "Partial differential equations and boundary value problems using Fourier series. This is the third course in a sequence of three: Mth 570, Mth 571, and Mth 572  which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 571"]}, {"depart": "\nMth", "id": "577", "name": "Mathematical Control Theory I\r\n", "desc": "Mathematical foundations of linear time invariant control systems. Controllability, observability, stabilizability, feedback. Applications. This is the first course in a sequence of two: Mth 577 and Mth 578 which must be taken in sequence.  Expected preparation: Mth 253, Mth 254.", "cred": "3", "p": null, "pre": ["Mth 256"]}, {"depart": "\nMth", "id": "578", "name": "Mathematical Control Theory II\r\n", "desc": "Elements of the calculus of variations and optimal control. Dynamic programming. Pontryagin maximum principle. Applications. This is the second course in a sequence of two: Mth 577 and Mth 578 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 577"]}, {"depart": "\nMth", "id": "580", "name": "Systems Analysis: Calculus of Variations\r\n", "desc": "Basic problems of the calculus of variations. Euler equations. Lagrange conditions. Lagrange multipliers. Lagrange equations. Hamilton's equations. Application to mechanical and electrical systems.", "cred": "3", "p": null, "pre": ["Mth 256", "Mth 422", "Mth 522"]}, {"depart": "\nMth", "id": "581", "name": "Topics in Probability for Mathematics Teachers\r\n", "desc": "Selected topics in probability for mathematics teachers. Topics may include origins and development of probability theory, counting theory, laws of probability, conditional probability, independence, odds, standard discrete and continuous probability distributions, expected values, moment generating functions, and numerous computer simulations.  With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Stat 244", "Stat 452", "Stat 462"]}, {"depart": "\nMth", "id": "582", "name": "Topics in Statistics for Mathematics Teachers\r\n", "desc": "Selected topics in statistics for mathematics teachers.  Potential topics include descriptive statistics (measures of center, variability, skewness, etc.), inferential statistics (one and two population problems), Central Limit Theorem, modeling and simulation techniques, and research design techniques. With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Stat 244", "Stat 452", "Stat 462"]}, {"depart": "\nMth", "id": "583", "name": "Topics in Geometry for Mathematics Teachers\r\n", "desc": "Selected topics in geometry for mathematics teachers.  Potential topics include inductive and deductive reasoning, analytic and metric geometry, isometry and symmetry, and hyperbolic, spherical and/or taxicab geometry.  With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 338"]}, {"depart": "\nMth", "id": "584", "name": "Topics in Algebra for Mathematics Teachers\r\n", "desc": "Selected topics in algebra for mathematics teachers.  Potential topics may include algebraic structures (groups, rings, fields, vector spaces), equivalence, function, operation, well-defined-ness, equation solving, algorithms, and proving using geometric, symbolic, and verbal representation systems.  With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 344"]}, {"depart": "\nMth", "id": "585", "name": "Topics in Analysis for Mathematics Teachers\r\n", "desc": "Selected topics in analysis for mathematics teachers.  Potential topics include functions, limits, continuity, derivatives, integration, completeness, covariation, sequences and series, differential equations, complex analysis, and topology.  With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 311"]}, {"depart": "\nMth", "id": "586", "name": "Topics in The History of Mathematics\r\n", "desc": "Selected topics in the historical development of mathematics. With departmental approval, this course may be repeated for credit.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "587", "name": "Topics in Discrete Mathematics for Mathematics Teachers\r\n", "desc": "Selected topics in discrete mathematics for teachers. Potential topics include set theory, logic, elementary probability theory, relations, recursions, algorithms, counting theory, permutations, finance mathematics, combinations, graph theory, algorithms, logic, and number theory.  With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 356"]}, {"depart": "\nMth", "id": "588", "name": "Topics in Computing for Mathematics Teachers\r\n", "desc": "Selected topics and tools for mathematical computing for mathematics teachers.  As an example, a simple but powerful set of programming and graphical tools  in ‘C’ may be introduced and used to explore a wide range of mathematical topics including statistics, probability, trigonometry, analytic geometry, calculus and modeling. With departmental approval may be repeated for credit.", "cred": "3", "p": null, "pre": ["Mth 271", "CS 161", "Mth 344"]}, {"depart": "\nMth", "id": "589", "name": "Topics in Mathematical Exposition and Curriculum Development\r\n", "desc": "Selected topics in mathematics exposition and curriculum development. Potential topics may include specific mathematical topics (such as algebra, geometry, or statistics) or cross cutting topics (such as ethnomathematics or history of mathematics).", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "591", "name": "Experimental Probability and Statistics for Middle School Teachers\r\n", "desc": "A study of probability and statistics through laboratory experiments, simulations, and applications, with integration of problem solving and technology. Not approved for major credit. Available for graduate credit toward the graduate certificate program in middle school mathematics.", "cred": "4", "p": null, "pre": ["Mth 112", "Mth 212", "Mth 213"]}, {"depart": "\nMth", "id": "593", "name": "Geometry for Middle School Teachers\r\n", "desc": "Selected topics from informal geometry, both two- and three-dimensional, with integration of problem solving and technology. Not approved for major credit. Available for graduate credit toward the graduate certificate program in middle school mathematics.", "cred": "4", "p": null, "pre": ["Mth 112", "Mth 212", "Mth 213"]}, {"depart": "\nMth", "id": "594", "name": "Arithmetic and Algebraic Structures for Middle School Teachers\r\n", "desc": "The study of the real number system and its subsystems will lead to the introduction of more general algebraic structures and their applications, with focus on problem solving. Not approved for major credit. Available for graduate credit toward the graduate certificate program in middle school mathematics.", "cred": "4", "p": null, "pre": ["Mth 212", "Mth 213"]}, {"depart": "\nMth", "id": "595", "name": "Historical Topics in Mathematics for Middle School Teachers\r\n", "desc": "A survey of the historical development of topics in mathematics from ancient to modern times, with special emphasis on topics in arithmetic, algebra and informal geometry, and with integration of problem solving and technology. Not approved for major credit. Available for graduate credit toward the graduate certificate program in middle school mathematics.", "cred": "4", "p": null, "pre": ["Mth 112", "Mth 212", "Mth 213"]}, {"depart": "\nMth", "id": "596", "name": "Concepts of Calculus for Middle School Teachers\r\n", "desc": "An introduction to the limit concept and its role in defining the derivative, the integral and infinite series. Applications to middle school mathematics, with integration of problem solving and technology. Not approved for major credit. Available for graduate credit toward the graduate certificate program in middle school mathematics.", "cred": "4", "p": null, "pre": ["Mth 112", "Mth 212", "Mth 213"]}, {"depart": "\nMth", "id": "597", "name": "Mathematics in the Middle School Classroom\r\n", "desc": "A survey of mathematics taught in the middle school grades, with focus on both content and pedagogical recommendations of the National Council of Teachers of Mathematics, and with integration of problem solving and technology. Not approved for major credit. Available for graduate credit toward the graduate certificate program in mathematics for middle school teachers.", "cred": "4", "p": null, "pre": ["Mth 112", "Mth 212", "Mth 213"]}, {"depart": "\nMth", "id": "601", "name": "Research\r\n", "desc": "(Credit to be arranged.)", "cred": "9", "p": null, "pre": []}, {"depart": "\nMth", "id": "603", "name": "Dissertation\r\n", "desc": "(Credit to be arranged.)", "cred": "9", "p": null, "pre": []}, {"depart": "\nMth", "id": "604", "name": "Cooperative Education/Internship\r\n", "desc": "(Credit to be arranged.)", "cred": "9", "p": null, "pre": []}, {"depart": "\nMth", "id": "605", "name": "Reading and Conference\r\n", "desc": "(Credit to be arranged.)", "cred": "9", "p": null, "pre": []}, {"depart": "\nMth", "id": "606", "name": "Special Projects\r\n", "desc": "(Credit to be arranged.)", "cred": "12", "p": null, "pre": []}, {"depart": "\nMth", "id": "607", "name": "Seminar\r\n", "desc": "(Credit to be arranged.)", "cred": "9", "p": null, "pre": []}, {"depart": "\nMth", "id": "610", "name": "Selected Topics\r\n", "desc": "(Credit to be arranged.)", "cred": "9", "p": null, "pre": []}, {"depart": "\nMth", "id": "611", "name": "Theory of Functions of a Real Variable I\r\n", "desc": "Lebesgue measure and outer measure, measurable functions and the Lebesgue integral, convergence theorems, product measures, and Fubini's theorem. Lp spaces, derivates, derivative, finite variation and absolutely continuous functions. Courses must be taken in sequence. Expected preparation: Mth 412/Mth 512.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "612", "name": "Theory of Functions of a Real Variable II\r\n", "desc": "Lebesgue measure and outer measure, measurable functions and the Lebesgue integral, convergence theorems, product measures, and Fubini's theorem. Lp spaces, derivates, derivative, finite variation and absolutely continuous functions. Courses must be taken in sequence. Expected preparation: Mth 412/Mth 512.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "613", "name": "Theory of Functions of a Real Variable III\r\n", "desc": "Lebesgue measure and outer measure, measurable functions and the Lebesgue integral, convergence theorems, product measures, and Fubini's theorem. Lp spaces, derivates, derivative, finite variation and absolutely continuous functions. Courses must be taken in sequence. Expected preparation: Mth 412/Mth 512.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "614", "name": "Modern Analysis I\r\n", "desc": "Topics from nonlinear analysis, harmonic analysis, analytic functions, ordered vector spaces, analysis on Lie groups, and operator theory. This is the first course in a sequence of three: Mth 614, Mth 615, and Mth 616. Expected preparation: Mth 412/Mth 512.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "615", "name": "Modern Analysis II\r\n", "desc": "Topics from nonlinear analysis, harmonic analysis, analytic functions, ordered vector spaces, analysis on Lie groups, and operator theory. This is the second course in a sequence of three: Mth 614, Mth 615, and Mth 616. Expected preparation: Mth 412/Mth 512.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "616", "name": "Modern Analysis III\r\n", "desc": "Topics from nonlinear analysis, harmonic analysis, analytic functions, ordered vector spaces, analysis on Lie groups, and operator theory. This is the third course in a sequence of three: Mth 614, Mth 615, and Mth 616. Expected preparation: Mth 412/Mth 512.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "617", "name": "Functional Analysis I\r\n", "desc": "Hilbert and Banach spaces, the Hahn-Banach, open mapping, and closed graph theorems. Compact, self-adjoint, normal, and Fredholm operators. Locally convex spaces, weak topologies, duality. Banach- and C* -algebras, spectral theory. This is the first course in a sequence of three: Mth 617, Mth 618, and Mth 619 which must be taken in sequence. Expected preparation: Mth 412/Mth 512.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "618", "name": "Functional Analysis II\r\n", "desc": "Hilbert and Banach spaces, the Hahn-Banach, open mapping, and closed graph theorems. Compact, self-adjoint, normal, and Fredholm operators. Locally convex spaces, weak topologies, duality. Banach- and C* -algebras, spectral theory. This is the second course in a sequence of three: Mth 617, Mth 618, and Mth 619 which must be taken in sequence. Expected preparation: Mth 412/Mth 512.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "619", "name": "Functional Analysis III\r\n", "desc": "Hilbert and Banach spaces, the Hahn-Banach, open mapping, and closed graph theorems. Compact, self-adjoint, normal, and Fredholm operators. Locally convex spaces, weak topologies, duality. Banach- and C* -algebras, spectral theory. This is the third course in a sequence of three: Mth 617, Mth 618, and Mth 619 which must be taken in sequence. Recommended prerequisite: Mth 412/Mth 512.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "621", "name": "Advanced Differential Equations I\r\n", "desc": "Advanced theory of dynamial systems and partial differential equations including the basics of partial differential equations, boundary value problems for elliptic equations, the Cauchy problem, and parabolic equations. Topics selected from Hamiltonian systems, waves and shocks, variational methods, control theory. This is the first course in a sequence of three: Mth 621, Mth 622, and Mth 623. Expected preparation: Mth 423/Mth 523 or Mth 472/Mth 572.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "622", "name": "Advanced Differential Equations II\r\n", "desc": "Advanced theory of dynamial systems and partial differential equations including the basics of partial differential equations, boundary value problems for elliptic equations, the Cauchy problem, and parabolic equations. Topics selected from Hamiltonian systems, waves and shocks, variational methods, control theory. This is the second course in a sequence of three: Mth 621, Mth 622, and Mth 623. Expected preparation: Mth 423/Mth 523 or Mth 472/Mth 572.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "623", "name": "Advanced Differential Equations III\r\n", "desc": "Advanced theory of dynamial systems and partial differential equations including the basics of partial differential equations, boundary value problems for elliptic equations, the Cauchy problem, and parabolic equations. Topics selected from Hamiltonian systems, waves and shocks, variational methods, control theory. This is the third course in a sequence of three: Mth 621, Mth 622, and Mth 623. Expected preparation: Mth 423/Mth 523 or Mth 472/Mth 572.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "624", "name": "Advanced Differential Geometry I\r\n", "desc": "Topics selected from differentiable manifolds, differential forms, DeRham cohomology, Lie groups, fibre bundles, the Riemannian metric, affine and Riemannian connections, parallel translations, holonomy, geodesics, curvature, isometric embeddings and hypersurfaces, the Second Fundamental Form, complete Riemannian manifolds and the Hopf-Rinow theorem, spaces of constant curvature, variations of arc length, and the Morse Index theorem. This is the first course in a sequence of three: Mth 624, Mth 625, and Mth 626. Expected preparation: Mth 425/Mth 525.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "625", "name": "Advanced Differential Geometry II\r\n", "desc": "Topics selected from differentiable manifolds, differential forms, DeRham cohomology, Lie groups, fibre bundles, the Riemannian metric, affine and Riemannian connections, parallel translations, holonomy, geodesics, curvature, isometric embeddings and hypersurfaces, the Second Fundamental Form, complete Riemannian manifolds and the Hopf-Rinow theorem, spaces of constant curvature, variations of arc length, and the Morse Index theorem. This is the second course in a sequence of three: Mth 624, Mth 625, and Mth 626. Expected preparation: Mth 425/Mth 525.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "626", "name": "Advanced Differential Geometry III\r\n", "desc": "Topics selected from differentiable manifolds, differential forms, DeRham cohomology, Lie groups, fibre bundles, the Riemannian metric, affine and Riemannian connections, parallel translations, holonomy, geodesics, curvature, isometric embeddings and hypersurfaces, the Second Fundamental Form, complete Riemannian manifolds and the Hopf-Rinow theorem, spaces of constant curvature, variations of arc length, and the Morse Index theorem. This is the third course in a sequence of three: Mth 624, Mth 625, and Mth 626. Expected preparation: Mth 425/Mth 525.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "634", "name": "Algebraic Topology I\r\n", "desc": "Topics from singular and simplicial homology and cohomology theories, fundamental group and covering spaces, CW complexes and elements of homotopy theory, algebraic theory of manifolds, introduction to differential topology and vector bundles, applications. This is the first course in a sequence of three: Mth 634, Mth 635, and Mth 636 which must be taken in sequence. Recommended prerequisites: Mth 435/Mth 535 and Mth 444/Mth 544.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "635", "name": "Algebraic Topology II\r\n", "desc": "Topics from singular and simplicial homology and cohomology theories, fundamental group and covering spaces, CW complexes and elements of homotopy theory, algebraic theory of manifolds, introduction to differential topology and vector bundles, applications. This is the second course in a sequence of three: Mth 634, Mth 635, and Mth 636 which must be taken in sequence. Expected preparation: Mth 435/Mth 535 and Mth 444/Mth 544.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "636", "name": "Algebraic Topology III\r\n", "desc": "Topics from singular and simplicial homology and cohomology theories, fundamental group and covering spaces, CW complexes and elements of homotopy theory, algebraic theory of manifolds, introduction to differential topology and vector bundles, applications. This is the third course in a sequence of three: Mth 634, Mth 635, and Mth 636 which must be taken in sequence. Expected preparation: Mth 435/Mth 535 and Mth 444/Mth 544.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "637", "name": "Geometric Topology I\r\n", "desc": "Topics from geometric and piecewise linear topology, knots and 3-manifolds and gauge theories, geometric structures and geometrization of manifolds, applications to differential topology, vector bundles and to mathematical physics. This is the first course in a sequence of three: Mth 637 Mth 638, and Mth 639. Expected preparation: Mth 436/Mth 536.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "638", "name": "Geometric Topology II\r\n", "desc": "Topics from geometric and piecewise linear topology, knots and 3-manifolds and gauge theories, geometric structures and geometrization of manifolds, applications to differential topology, vector bundles and to mathematical physics. This is the second course in a sequence of three: Mth 637 Mth 638, and Mth 639. Expected preparation: Mth 436/Mth 536.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "639", "name": "Geometric Topology III\r\n", "desc": "Topics from geometric and piecewise linear topology, knots and 3-manifolds and gauge theories, geometric structures and geometrization of manifolds, applications to differential topology, vector bundles and to mathematical physics. This is the third course in a sequence of three: Mth 637 Mth 638, and Mth 639. Expected preparation: Mth 436/Mth 536.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "641", "name": "Modern Algebra I\r\n", "desc": "Topics from groups, semigroups, rings, fields, algebras, and homological algebra. This is the first course in a sequence of three: Mth 641, Mth 642, and Mth 643. Expected preparation: Mth 443/Mth 543 or both Mth 442/Mth 542 and Mth 445/Mth 545.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "642", "name": "Modern Algebra II\r\n", "desc": "Topics from groups, semigroups, rings, fields, algebras, and homological algebra. This is the second course in a sequence of three: Mth 641, Mth 642, and Mth 643. Expected preparation: Mth 443/Mth 543 or both Mth 442/Mth 542 and Mth 445/Mth 545.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "643", "name": "Modern Algebra III\r\n", "desc": "Topics from groups, semigroups, rings, fields, algebras, and homological algebra. This is the third  course in a sequence of three: Mth 641, Mth 642, and Mth 643. Expected preparation: Mth 443/Mth 543 or both Mth 442/Mth 542 and Mth 445/Mth 545.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "651", "name": "Advanced Numerical Analysis I\r\n", "desc": "An advanced study of numerical methods with emphasis on theory, economy of computation, and the solution of pathological problems. Topics will typically be chosen from: evaluation of functions, roots of equations, quadrature, ordinary and partial differential equations, integral equations, eigenvalues, construction of approximating functions, orthonomalizing codes, and treatment of singularities. This is the first course in a sequence of three: Mth 651, Mth 652, and Mth 653 which must be taken in sequence. Expected preparation: Mth 453/Mth 553.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "652", "name": "Advanced Numerical Analysis II\r\n", "desc": "An advanced study of numerical methods with emphasis on theory, economy of computation, and the solution of pathological problems. Topics will typically be chosen from: evaluation of functions, roots of equations, quadrature, ordinary and partial differential equations, integral equations, eigenvalues, construction of approximating functions, orthonomalizing codes, and treatment of singularities. This is the second course in a sequence of three: Mth 651, Mth 652, and Mth 653 which must be taken in sequence. Expected preparation: Mth 453/Mth 553.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "653", "name": "Advanced Numerical Analysis III\r\n", "desc": "An advanced study of numerical methods with emphasis on theory, economy of computation, and the solution of pathological problems. Topics will typically be chosen from: evaluation of functions, roots of equations, quadrature, ordinary and partial differential equations, integral equations, eigenvalues, construction of approximating functions, orthonomalizing codes, and treatment of singularities. This is the third course in a sequence of three: Mth 651, Mth 652, and Mth 653 which must be taken in sequence. Expected preparation: Mth 453/Mth 553.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "661", "name": "Algebraic Graph Theory I\r\n", "desc": "Topics selected from algebraic and spectral graph theory, including automorphism groups, transitivity, primitivity, homomorphisms, generalized polygons, designs, projective planes, cores, fractional colorings and cliques, spectral decomposition, eigenvalue interlacing, strongly-regular and distance-regular graphs, line graphs, root systems, graph laplacians, graph polynomials, and graph-theoretic link invariants. This is the first course in a sequence of three: Mth 661, Mth 662, and Mth 663 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 462", "Mth 562"]}, {"depart": "\nMth", "id": "662", "name": "Algebraic Graph Theory II\r\n", "desc": "Topics selected from algebraic and spectral graph theory, including automorphism groups, transitivity, primitivity, homomorphisms, generalized polygons, designs, projective planes, cores, fractional colorings and cliques, spectral decomposition, eigenvalue interlacing, strongly-regular and distance-regular graphs, line graphs, root systems, graph laplacians, graph polynomials, and graph-theoretic link invariants. This is the second course in a sequence of three: Mth 661, Mth 662, and Mth 663 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 462", "Mth 562"]}, {"depart": "\nMth", "id": "663", "name": "Algebraic Graph Theory III\r\n", "desc": "Topics selected from algebraic and spectral graph theory, including automorphism groups, transitivity, primitivity, homomorphisms, generalized polygons, designs, projective planes, cores, fractional colorings and cliques, spectral decomposition, eigenvalue interlacing, strongly-regular and distance-regular graphs, line graphs, root systems, graph laplacians, graph polynomials, and graph-theoretic link invariants. This is the third course in a sequence of three: Mth 661, Mth 662, and Mth 663 which must be taken in sequence.", "cred": "3", "p": null, "pre": ["Mth 462", "Mth 562"]}, {"depart": "\nMth", "id": "667", "name": "Stochastic Processes and Probability Theory I\r\n", "desc": "Sets, spaces, and measures. Probability distributions. Random variables. Dependence. Limit theorems. Birth and death processes and Markov processes. Mathematical statistics, hypothesis testing, and sequential analysis. Selected applications. This is the first course in a sequence of three: Mth 667, Mth 668, Mth 669 which must be taken in sequence. Expected preparation: Mth 411/Mth 511, Stat 463/Stat 563.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "668", "name": "Stochastic Processes and Probability Theory II\r\n", "desc": "Sets, spaces, and measures. Probability distributions. Random variables. Dependence. Limit theorems. Birth and death processes and Markov processes. Mathematical statistics, hypothesis testing, and sequential analysis. Selected applications. This is the second course in a sequence of three: Mth 667, Mth 668, Mth 669 which must be taken in sequence. Expected preparation: Mth 411/Mth 511, Stat 463/Stat 563.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "669", "name": "Stochastic Processes and Probability Theory III\r\n", "desc": "Sets, spaces, and measures. Probability distributions. Random variables. Dependence. Limit theorems. Birth and death processes and Markov processes. Mathematical statistics, hypothesis testing, and sequential analysis. Selected applications. This is the third course in a sequence of three: Mth 667, Mth 668, Mth 669 which must be taken in sequence. Expected preparation: Mth 411/Mth 511, Stat 463/Stat 563.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "690", "name": "Introduction to Research in Mathematics Education\r\n", "desc": "Topics in the history of mathematics education including an examination of the current research trends in mathematics education.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "691", "name": "Curriculum in Mathematics Education\r\n", "desc": "An analysis of curriculum development and assessment efforts in mathematics education both past and present.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "692", "name": "Research Methodology and Design\r\n", "desc": "An examination of quantitative and qualitative research methodologies and their applications to the design of research in mathematics education.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "693", "name": "Research on the Learning of Mathematics\r\n", "desc": "An analysis of the mathematics education research on the learning of mathematics, including topics from K-16 mathematics.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "694", "name": "Research on the Teaching of Mathematics\r\n", "desc": "An analysis of the research on the teaching of mathematics, including issues from levels K-16.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "695", "name": "Topics in Research in Mathematics Education\r\n", "desc": "A special topics seminar devoted to exploring particular issues in more depth.", "cred": "3", "p": null, "pre": []}, {"depart": "\nMth", "id": "801", "name": "Research\r\n", "desc": "(Credit to be arranged.)", "cred": "12", "p": null, "pre": []}, {"depart": "\nMth", "id": "802", "name": "Independent Study\r\n", "desc": "(Credit to be arranged.)", "cred": "12", "p": null, "pre": []}, {"depart": "\nMth", "id": "804", "name": "Cooperative Education/Internship\r\n", "desc": "(Credit to be arranged.)", "cred": "12", "p": null, "pre": []}, {"depart": "\nMth", "id": "805", "name": "Reading and Conference\r\n", "desc": "(Credit to be arranged.)", "cred": "12", "p": null, "pre": []}, {"depart": "\nMth", "id": "806", "name": "Special Problems/Projects\r\n", "desc": "(Credit to be arranged.)", "cred": "12", "p": null, "pre": []}, {"depart": "\nMth", "id": "807", "name": "Seminar\r\n", "desc": "(Credit to be arranged.)", "cred": "12", "p": null, "pre": []}, {"depart": "\nMth", "id": "808", "name": "Workshop\r\n", "desc": "(Credit to be arranged.)", "cred": "12", "p": null, "pre": []}, {"depart": "\nMth", "id": "809", "name": "Practicum\r\n", "desc": "(Credit to be arranged.)", "cred": "12", "p": null, "pre": []}, {"depart": "\nMth", "id": "810", "name": "Selected Topics\r\n", "desc": "(Credit to be arranged.)", "cred": "12", "p": null, "pre": []}]}